{
 "posts": [
  {
   "title": "Scrum.org Terms of Use",
   "url": "https://www.scrum.org/forum/scrum-forum/7825/scrumorg-terms-use",
   "nb_replies": "0"
  },
  {
   "title": "Product backlog management responsibility",
   "url": "https://www.scrum.org/forum/scrum-forum/8195/product-backlog-management-responsibility",
   "nb_replies": "5"
  },
  {
   "title": "Writing Test cases in Agile",
   "url": "https://www.scrum.org/forum/scrum-forum/8198/writing-test-cases-agile",
   "nb_replies": "2"
  },
  {
   "title": "Do items listed in your defintion of done end up on your taskboard as individual tasks?",
   "url": "https://www.scrum.org/forum/scrum-forum/8203/do-items-listed-your-defintion-done-end-your-taskboard-individual-tasks",
   "nb_replies": "1"
  },
  {
   "title": "Is self-organisation always appropriate?",
   "url": "https://www.scrum.org/forum/scrum-forum/8185/self-organisation-always-appropriate",
   "nb_replies": "6"
  },
  {
   "title": "Time Boxed Events",
   "url": "https://www.scrum.org/forum/scrum-forum/7242/time-boxed-events",
   "nb_replies": "8"
  },
  {
   "title": "Who is absolutely necessary for one of these meetings?",
   "url": "https://www.scrum.org/forum/scrum-forum/8011/who-absolutely-necessary-one-these-meetings",
   "nb_replies": "5"
  },
  {
   "title": "Story points vs hours",
   "url": "https://www.scrum.org/forum/scrum-forum/8196/story-points-vs-hours",
   "nb_replies": "2"
  },
  {
   "title": "Passed PSM I",
   "url": "https://www.scrum.org/forum/scrum-forum/8087/passed-psm-i",
   "nb_replies": "4"
  },
  {
   "title": "Who is allowed to attend a Daily Meeting",
   "url": "https://www.scrum.org/forum/scrum-forum/5349/who-allowed-attend-daily-meeting",
   "nb_replies": "24"
  },
  {
   "title": "A change to the Sprint Backlog during the Sprint",
   "url": "https://www.scrum.org/forum/scrum-forum/5894/change-sprint-backlog-during-sprint",
   "nb_replies": "5"
  },
  {
   "title": "Minimum length of a sprint and sprint goal",
   "url": "https://www.scrum.org/forum/scrum-forum/8166/minimum-length-sprint-and-sprint-goal",
   "nb_replies": "9"
  },
  {
   "title": "It's not difficult to pass PSM 1",
   "url": "https://www.scrum.org/forum/scrum-forum/8028/its-not-difficult-pass-psm-1",
   "nb_replies": "9"
  },
  {
   "title": "Development KPIs and Scrum?",
   "url": "https://www.scrum.org/forum/scrum-forum/8192/development-kpis-and-scrum",
   "nb_replies": "0"
  },
  {
   "title": "Open Invitation to Sprint Review",
   "url": "https://www.scrum.org/forum/scrum-forum/8186/open-invitation-sprint-review",
   "nb_replies": "3"
  },
  {
   "title": "non-functional requirements",
   "url": "https://www.scrum.org/forum/scrum-forum/7314/non-functional-requirements",
   "nb_replies": "9"
  },
  {
   "title": "Virtual Teams in Scrum Model",
   "url": "https://www.scrum.org/forum/scrum-forum/8163/virtual-teams-scrum-model",
   "nb_replies": "3"
  },
  {
   "title": "How to improve communication within a team",
   "url": "https://www.scrum.org/forum/scrum-forum/8088/how-improve-communication-within-team",
   "nb_replies": "5"
  },
  {
   "title": "Passed with 90%",
   "url": "https://www.scrum.org/forum/scrum-forum/8123/passed-90",
   "nb_replies": "1"
  },
  {
   "title": "Scrum practioner questions",
   "url": "https://www.scrum.org/forum/scrum-forum/8181/scrum-practioner-questions",
   "nb_replies": "0"
  },
  {
   "title": "Scrum Master Role In Building A Self Organized Team",
   "url": "https://www.scrum.org/forum/scrum-forum/8169/scrum-master-role-building-self-organized-team",
   "nb_replies": "0"
  },
  {
   "title": "Thoughts about *How Scrum works in a fixed Price Projects\"",
   "url": "https://www.scrum.org/forum/scrum-forum/5332/thoughts-about-how-scrum-works-fixed-price-projects",
   "nb_replies": "15"
  },
  {
   "title": "Unable to Understand a statement in Scrum Guide",
   "url": "https://www.scrum.org/forum/scrum-forum/8148/unable-understand-statement-scrum-guide",
   "nb_replies": "1"
  },
  {
   "title": "More than one product manager across a single platform?",
   "url": "https://www.scrum.org/forum/scrum-forum/8149/more-one-product-manager-across-single-platform",
   "nb_replies": "1"
  },
  {
   "title": "Completed PSM 1 with 96.3% first attempt",
   "url": "https://www.scrum.org/forum/scrum-forum/8142/completed-psm-1-963-first-attempt",
   "nb_replies": "1"
  }
 ],
 "messages": [
  {
   "title": "Scrum.org Terms of Use",
   "msg": "Messages",
   "url": "https://www.scrum.org/forum/scrum-forum/7825/scrumorg-terms-use",
   "last_post_date": "Last post 09:58 pm March 8, 2017"
  },
  {
   "title": "Scrum.org Terms of Use",
   "msg": "09:57 pm March 8, 2017\nScrum.org may, at its discretion, remove any post that it deems unsuitable for these forums. Unsuitable post content includes, but is not limited to, Scrum.org Professional-level assessment questions and answers, profanity, insults, racism or sexually explicit content. Using our forum as a platform for the marketing and solicitation of products or services is also prohibited. Forum members who post content deemed unsuitable by Scrum.org may have their access revoked at any time, without warning. Scrum.org may, but is not obliged to, monitor submissions.",
   "url": "https://www.scrum.org/forum/scrum-forum/7825/scrumorg-terms-use",
   "last_post_date": "Last post 09:58 pm March 8, 2017"
  },
  {
   "title": "Product backlog management responsibility",
   "msg": "Messages",
   "url": "https://www.scrum.org/forum/scrum-forum/8195/product-backlog-management-responsibility",
   "last_post_date": "Last post 07:22 am April 7, 2017"
  },
  {
   "title": "Product backlog management responsibility",
   "msg": "04:07 am April 6, 2017\nHi All,\nI wanted to gain clarification regarding two statements in the scrum guide.\nThe guide says \"The Product Owner is the sole person responsible for managing the Product Backlog\" , however, it also says \"The Product Owner may do the above work, or have the Development Team do it. However, the Product Owner remains accountable.\".\nTherefore, is it not right to say that the work of managing the product backlog does not solely belong to the product owner??",
   "url": "https://www.scrum.org/forum/scrum-forum/8195/product-backlog-management-responsibility",
   "last_post_date": "Last post 07:22 am April 7, 2017"
  },
  {
   "title": "Product backlog management responsibility",
   "msg": "05:33 am April 6, 2017\nIt's important to be clear about where responsibility lies irrespective of how the execution of work occurs.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8195/product-backlog-management-responsibility",
   "last_post_date": "Last post 07:22 am April 7, 2017"
  },
  {
   "title": "Product backlog management responsibility",
   "msg": "02:01 pm April 6, 2017\n@Ian, If asked if the product backlog is managed solely by the product owner -True or False, then based on what the scrum guide says, wouldnt it be appropriate to say False?\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8195/product-backlog-management-responsibility",
   "last_post_date": "Last post 07:22 am April 7, 2017"
  },
  {
   "title": "Product backlog management responsibility",
   "msg": "05:16 pm April 6, 2017\nNot necessarily, because the Product Owner can authorize the Development Team to work on the Product Backlog. This may or may not be seen as \"managing\" it. Hence it is important to be quite clear about the actual responsibility for Product Backlog management (i.e. in the sense of accountability), which always lies with the Product Owner.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8195/product-backlog-management-responsibility",
   "last_post_date": "Last post 07:22 am April 7, 2017"
  },
  {
   "title": "Product backlog management responsibility",
   "msg": "05:38 pm April 6, 2017\nManaging the product backlog is the sole responsibility of the Product Owner. It may or may not be solely performed by the Product Owner.\nFor your hypothetical question, I would answer True. Having the option to delegate work does not change the intent of the activity, or the responsibility of who maintains, monitors and manages that activity. Yes, there is a possible scenario where someone other than the product owner can manage the backlog, but that is an allowed exception, rather than part of the core definition.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8195/product-backlog-management-responsibility",
   "last_post_date": "Last post 07:22 am April 7, 2017"
  },
  {
   "title": "Product backlog management responsibility",
   "msg": "07:22 am April 7, 2017\nFantastic guys !! read through the comments I am forced to say great clarifications..\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8195/product-backlog-management-responsibility",
   "last_post_date": "Last post 07:22 am April 7, 2017"
  },
  {
   "title": "Writing Test cases in Agile",
   "msg": "Messages",
   "url": "https://www.scrum.org/forum/scrum-forum/8198/writing-test-cases-agile",
   "last_post_date": "Last post 06:47 am April 7, 2017"
  },
  {
   "title": "Writing Test cases in Agile",
   "msg": "12:18 pm April 6, 2017\nI was going through a lot of articles and blogs but still i am unable to understand that if we really need test cases in scrum? Acceptance criteria is treated as test cases but those are not actually test cases in my opinion. What is the best practice we can follow or can we use test cases along with acceptance criteria in order make QA process more efficient.",
   "url": "https://www.scrum.org/forum/scrum-forum/8198/writing-test-cases-agile",
   "last_post_date": "Last post 06:47 am April 7, 2017"
  },
  {
   "title": "Writing Test cases in Agile",
   "msg": "01:22 pm April 6, 2017\nHow about using test driven development, with automated regression testing, as a means to improve efficiency?\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8198/writing-test-cases-agile",
   "last_post_date": "Last post 06:47 am April 7, 2017"
  },
  {
   "title": "Writing Test cases in Agile",
   "msg": "06:47 am April 7, 2017\nThats more relevant to writing good code. In some scenarios the testers are not technical enough. So the testers will have to write descriptive statements like test cases or acceptance test. What will we do in that case?\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8198/writing-test-cases-agile",
   "last_post_date": "Last post 06:47 am April 7, 2017"
  },
  {
   "title": "Do items listed in your defintion of done end up on your taskboard as individual tasks?",
   "msg": "Messages",
   "url": "https://www.scrum.org/forum/scrum-forum/8203/do-items-listed-your-defintion-done-end-your-taskboard-individual-tasks",
   "last_post_date": "Last post 01:59 am April 7, 2017"
  },
  {
   "title": "Do items listed in your defintion of done end up on your taskboard as individual tasks?",
   "msg": "09:49 pm April 6, 2017\nDo items listed in your defintion of done end up on your taskboard as individual tasks? For example, let's say your definition of done include the following:\nCode Reviewed\nDeployed to environment\nTested\nAnd let's say the team has determined the following code changes need to be made to implement a given PBI.\nImplement Form\nAdd Validation Checks\nAdd Error Notification Messages\nWhen you look at your taskboard would you see the following tasks or would you simply see the 3 coding tasks as it's implied that each task would need to be code reviewed, deployed, and tested before the task could be set to done?\nImplement Basic Form\nImplement Validation Checks\nImplement Error Notifications\nCode Reviewed\nDeployed to environment\nTested",
   "url": "https://www.scrum.org/forum/scrum-forum/8203/do-items-listed-your-defintion-done-end-your-taskboard-individual-tasks",
   "last_post_date": "Last post 01:59 am April 7, 2017"
  },
  {
   "title": "Do items listed in your defintion of done end up on your taskboard as individual tasks?",
   "msg": "01:59 am April 7, 2017\nAll 6 of those activities represent work to be done, so explicitly planning each one as a task would provide good visibility over the work remaining.\nAnother option may be to capture Review, Deployment, and Testing as finer-grained stations for Work In Progress, such as by including them as columns on a team board. Each PBI would thus need to be reviewed, deployed, and tested before it is Done.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8203/do-items-listed-your-defintion-done-end-your-taskboard-individual-tasks",
   "last_post_date": "Last post 01:59 am April 7, 2017"
  },
  {
   "title": "Is self-organisation always appropriate?",
   "msg": "Messages",
   "url": "https://www.scrum.org/forum/scrum-forum/8185/self-organisation-always-appropriate",
   "last_post_date": "Last post 09:29 pm April 6, 2017"
  },
  {
   "title": "Is self-organisation always appropriate?",
   "msg": "03:33 pm April 5, 2017\nHello there fellow Scrum enthusiasts,\nThroughout my experience as a Scrum Master, I've worked with many developers who were very happy to broaden their skillset, accept ownership of their team's success, and take the necessary initiatives to self-organize. However, I've also met developers who were in the field because they liked working with software, but who wanted as little to do with the \"management and organization stuff\" as they could. I've heard the phrase before \"Can't we just have someone in charge who knows what they're doing, makes the calls and tells us what to do?\" and I've heard many developers argue that, in their mind, it couldn't work any other way. You can show someone data showing that it does work, but if they're not comfortable with that kind of organization, it's not facts that will change their mind (psychology researcher Jonathan Haidt has a lot to say about that in his research).\nI've read Dan Pink's Drive, and I am aware of what a self-organized team can achieve. Personally, I like to think that I strive for an intrinsically motivating job. At the same time, if someone tells me that what they prefer is a 9 to 5 job that pays the bills and where they can just do what's asked of them, then who am I to try to convince them that they should strive for something else, that they should aim for a different life? To me, that kind of value judgement smells of arrogance and elitism.\nSome people might say that it's fine that some people prefer that kind of job, but that in building an agile organization, these are not the kind of people you want on your team. Alright, I can agree that it's important that people's values should fit with their employer's. What do you do, then, when a CEO decides that the organization will attempt an \"agile transformation\"? Can you really just ask people to adapt or leave? To what degree does the organization have some responsibility to be flexible with its employees different personalities?\nThere might be cultural factors at play too. From its inspiration in Takeuchi and Nonaka's article, Scrum seems to have been influenced quite a bit by Japanese work culture, a country where people, if I'm not mistaken, are often given a job-for-life, and a strong spirit of collectivity. I'm particularly interested in Geert Hofstede's research on culture's dimensions, two of which, the Power Distance and Individualism of a culture, would likely have a large impact on how tolerant people might be to have no central figure of authority and collective objectives. I've also been told by a management professor with cross-cultural experience in Thailand (and I might have understood this wrong) that the Thai Buddhist culture sometimes favours repetitive, brainless jobs, jobs where one can achieve detachment from desires; isn't that in conflict with the core assumption behind self-organized team that people flourish in stimulating jobs? Does it really make sense to try to copy and paste a set of value on people who do not necessarily share these values?\nMy impression is that there isn't a cut and dried solution, but I'd like to hear your opinions on the matter.",
   "url": "https://www.scrum.org/forum/scrum-forum/8185/self-organisation-always-appropriate",
   "last_post_date": "Last post 09:29 pm April 6, 2017"
  },
  {
   "title": "Is self-organisation always appropriate?",
   "msg": "04:42 pm April 5, 2017\n> I've heard the phrase before \"Can't we just have someone in charge who knows what they're doing, makes the calls and tells us what to do?\"\nWhat was the answer to that question though, in each situation when you heard it? It may or may not be true.\nIf an organization actually needs a Scrum transformation in order to survive, then there seems little point in hedging, because the answer must surely be \"no\". The matter is then one of securing the necessary sponsorship for change, and of communicating the need for it. Scrum requires self-organizing teams which manage themselves using empiricism. The communication of such a necessity is ultimately the responsibility of the organization's accountable officers. A Scrum Master can assist transformation in a number of ways, but there is no button for enterprise change which a Scrum Master can or should push.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8185/self-organisation-always-appropriate",
   "last_post_date": "Last post 09:29 pm April 6, 2017"
  },
  {
   "title": "Is self-organisation always appropriate?",
   "msg": "05:54 pm April 5, 2017\n> What was the answer to that question though, in each situation when you heard it? It may or may not be true.\nIf I thought I had the definitive answer to that question, we wouldn't be having this discussion.\n> If an organization actually needs a Scrum transformation in order to survive\nIsn't that a pretty big \"if\"?\nIf there is no immediate threat to survival, and Scrum transformation is seen in the context of performance (which fits my personal experience), then I believe there is a case to be made for the moral responsibility of the organization towards its employees, which in some cases could be at the expense of some performance. Some people will argue the organization has responsibility towards noone but its shareholders; that's a whole debate on its own...\nI completely agree with you on the necessity for change sponsorship, and for the communication of the organization's desire to have self-organizing and empirically managed teams. That is, if the organization actually wants those things.\nYou've made me realize that if the organization does communicate clear values and a clear management philosophy, if the organization clearly expresses a desire for an agile transformation, then it is probably reasonable to expect employees to follow those values, even if they are not their own, and to adapt to this new organization.\nWhere I am still hesitant: While I am certain organizations are aware of the potential advantages of an agile transformation, I don't think its potential impact on employees (sometimes positive, sometimes not), and the risks associated with a culture change of that magnitude, are usually well understood. We know agile organizations are usually effective, but that doesn't mean that making your organization agile will be a positive change.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8185/self-organisation-always-appropriate",
   "last_post_date": "Last post 09:29 pm April 6, 2017"
  },
  {
   "title": "Is self-organisation always appropriate?",
   "msg": "06:41 pm April 6, 2017\nI don't think comparing Scrum with Thai buddhist culture is the right thought they both have their own purpose.\nScrum became popular because its strength lies in the core principles and set of ingredients that make it effective. Once of those ingredients is a self-organizing team.\nIf team member(s) do not believe or do not want to self-organize or take ownership and responsibility it is the role of the SM to patiently wait , coach, train and advocate the benefits of being a self-organized team. I think your opinion about avoiding conflict (a big NO for scrum!) w.r.t their belief system will change once you read books about how to coach your agile team (Coaching Agile Teams - the book - by Lyssa Adkins is what helped me, but there are others like The Five Dysfunctions of a Team by Patrick Lencioni which helps you understand how to deal with team members of different emotions)\nRemember that SMs are not usually given a team of 3-9 CERTIFIED Scrum development team members. I follow the following steps to expose such individuals to the Agile/Scrum IDEOLOGY.\n1) There are numerous online resources/videos and shot exams that will challenge their knowledge of scrum and teach them in the process. Many organizations have certifications and tutorials to pass every year (HIPAA, PHI for example). Talk to management about the problem and propose a certificate program for becoming a scrum development team member. Just like out beliefs have transformed through out coaching and training sessions, their opinions will change too!\n2) Hold lunch and learn sessions and attempt the online exams as a team. As you answer and reason the wrong answers the information discussed and the concepts of self organizing team will repeat and stay ingrained in our minds (example = you and me!)\n3) I never force the belief, I always wait for the right occasion or moment. Some times it could be happy hour discussion about a great football game where the team is in awe of the team effort of players on field! Use that moment to draw analogy of how it can be employed to your team! Use examples of online collaborative video games where people share resources/troops as an example of the experts can train others and others can seek help without fear and hesitation so that all team members acquire and grow their knowledge to form a solid team will all members having multiple skills. As this happens the team automatically becomes self -organized as well!\n4) Team building events greatly helps. When people know about each other other than their job persona things will be eased and they can start taking ownership of things and even enjoy getting things done a a group. The feeling of yours vs mine should be abolished to build a harmonious self -organized cross-functional team.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8185/self-organisation-always-appropriate",
   "last_post_date": "Last post 09:29 pm April 6, 2017"
  },
  {
   "title": "Is self-organisation always appropriate?",
   "msg": "08:30 pm April 6, 2017\nI didn't mean to compare Scrum to Thai Buddhist culture (it's not a question of whether one or the other is valid), I meant to point out how one's culture and the values carried by that culture can be in direct conflict with the values behind Scrum. My questioning was: in such a case, can you force a set of values upon an individual? If they are the organization's values, perhaps (Dr Mitchell's convinced me here), but what about the cases where that part is not so clear?\nBoth Patrick Lencioni's book and Lyssa Adkins are great. They've shaped a lot of my opinions on what makes a great team and what makes a great coach. I'm not saying I don't believe in the strength of a self-organized team. However, what I do believe is that it's not always in the best interest of all when an agile coach attempts to take a team there.\nA glaring difference I see between agile coaching and some other forms of coaching is that the agile coach must keep in the back of their head the interests of the organization (and the agile transformation), whereas a personal coach, for instance, always puts the coachee first. This makes a difference in the (maybe rare) cases where, for example, it becomes obvious that the coachee does not want to self-organize. If, as a coach, you come in with the belief that you know what's best for the coachee, and disregard their own stated opinion on the matter, is that really coaching? If you have an agenda other than the coachee's interest, when does coaching become salesmanship? When does it become manipulation?\nJust to be clear: I'm not saying to avoid conflict, but perhaps to be mindful of the causes and consequences of that conflict.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8185/self-organisation-always-appropriate",
   "last_post_date": "Last post 09:29 pm April 6, 2017"
  },
  {
   "title": "Is self-organisation always appropriate?",
   "msg": "09:11 pm April 6, 2017\nI think you had exactly the same question like I did \" If, as a coach, you come in with the belief that you know what's best for the coachee, and disregard their own stated opinion on the matter, is that really coaching? \"\nI was not convinced it is possible until I read Coaching Agile Teams - the book - by Lyssa Adkins . In one of the chapters on coaching techniques She advocates of meeting them half step not even one step. What she meant based on my reading is when we have a rule to be followed and even if they have some aspect of it that they like we will stick on to that and build on top of it with patience. Even after all this some people will not be willing to change like you mentioned.\nI guess the only option at this time is to respect each others views and agree to an arrangement that is best for both! I mean I have seen some individuals who do not even believe in Agile to the extent that they wont even yield to have a quick read of my suggestion or join me to an agile webinar or event. Obviously they may want to pursue career at an organization that is not agile. there is no option there. But I would try everything before I come to that conclusion :)\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8185/self-organisation-always-appropriate",
   "last_post_date": "Last post 09:29 pm April 6, 2017"
  },
  {
   "title": "Is self-organisation always appropriate?",
   "msg": "09:29 pm April 6, 2017\nAnother way to put it is, coaching only comes into play when opinions have to be tailored and conditioned, Right? Other wise they may not even need coaching. I remember those who get it right away! These people actually help my cause by setting example, being there with me during the lunch and learn and training sessions, helping me and adding their own reasons and experiences of why Agile is best. They help me coach and train.\nLyssa also differentiates between coaching and training , where she attributes training (as if you are training a fighter who WANTS to learn fighting) and coaching as how to best use the skills they already have. Obviously, coaching is a way to apply learning in an informed way. Training is used for things like new-hire orientation, changes in processes, procedures, or technology, and new governmental regulations. So first you train even if they have questions about why they have to do what they are doing (compare this with wax on wax off of the karate kid movie). I guess if the employees are not willing to get trained that means they do not want to CONSIDER agile and therefore do not want to be with the company. As simple as that.\nAnd the best way out of this situation is when you hire the new employee with an Agile need. Now that you mention this hardship of coaching I remember how the new employees always are willing and adapting to the process without much complaints! Because they already know what they signed for and they are in the training mode where they are ready to learn an entirely new or foreign concept with minimum questions (orientation style) unlike the existing employees who need to be connected through their pain points and should really believe that the change will help resolve the problems they are facing in current process. In my experience thought different teams and persons took extremely wide range of times ( days to months and years) to finally get it, they all either got it or left before getting it, but were always engaged in the discussion, because the process of training and coaching never stops for a SM.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8185/self-organisation-always-appropriate",
   "last_post_date": "Last post 09:29 pm April 6, 2017"
  },
  {
   "title": "Time Boxed Events",
   "msg": "Messages",
   "url": "https://www.scrum.org/forum/scrum-forum/7242/time-boxed-events",
   "last_post_date": "Last post 08:52 pm April 6, 2017"
  },
  {
   "title": "Time Boxed Events",
   "msg": "12:22 am July 13, 2016\nAll the Scrum events like Sprint Planning, Sprint, Daily Scrum are time boxed. The event should end as soon as the objective of the event is reached or if the time expires.\nThis is true,according to me.If Sprint planning is 8 hour time boxed event,but needs 6 hours to finish the planning,in that case the event should end.IS that correct?\nThanks,",
   "url": "https://www.scrum.org/forum/scrum-forum/7242/time-boxed-events",
   "last_post_date": "Last post 08:52 pm April 6, 2017"
  },
  {
   "title": "Time Boxed Events",
   "msg": "10:48 am July 14, 2016\nYou're correct. A timebox is a maximum time, not an exact time - and certainly not a minimum!\nThe daily Scrum is timeboxed to 15 minutes, but doesn't need to last that long if everyone has said their piece. It's the same in the other events.\nYou might also want to pick this up in your Retrospectives, to explore whether the team had enough information from the planning to be able to achieve the Sprint Goal by the end of the Sprint.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/7242/time-boxed-events",
   "last_post_date": "Last post 08:52 pm April 6, 2017"
  },
  {
   "title": "Time Boxed Events",
   "msg": "02:46 pm July 15, 2016\nI want to make a clarification here. All Scrum events are time boxed. This is true.\nBut Sprint itself doesn't end if the work is over. Sprints length do not change in the middle of the Sprint.\nAll other events end as soon as the objective of the event is met.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/7242/time-boxed-events",
   "last_post_date": "Last post 08:52 pm April 6, 2017"
  },
  {
   "title": "Time Boxed Events",
   "msg": "08:55 pm July 15, 2016\nAll events are time-boxed events, such that every event has a maximum duration. Once a Sprint begins, its duration is fixed and cannot be shortened or lengthened. The remaining events may end whenever the purpose of the event is achieved, ensuring an appropriate amount of time is spent without allowing waste in the process.\nhttp://scrumguides.org/scrum-guide.html#events\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/7242/time-boxed-events",
   "last_post_date": "Last post 08:52 pm April 6, 2017"
  },
  {
   "title": "Time Boxed Events",
   "msg": "04:19 am April 6, 2017\nAccording to the scrum guide \"Sprint Planning is time-boxed to a maximum of eight hours for a one-month Sprint. For shorter Sprints, the event is usually shorter. \", however I read elsewhere that based on the above this means that a 1 week sprint's planning event should be 2 hours, similarly if its a two week sprint, then it would be 4 hours. How accurate is this information?\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/7242/time-boxed-events",
   "last_post_date": "Last post 08:52 pm April 6, 2017"
  },
  {
   "title": "Time Boxed Events",
   "msg": "05:44 am April 6, 2017\nFor the sake of the exams, it's accurate. If you had a hypothetical one-week sprint, you'd cut all your timeboxes by 75%(except for one specific timebox).\nIn practical use, if you're planning 25% of the items, do you see a reason for needing more than 25% of the time to do it? Is there a portion of planning that takes a fixed duration regardless of the scale of your sprints?\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/7242/time-boxed-events",
   "last_post_date": "Last post 08:52 pm April 6, 2017"
  },
  {
   "title": "Time Boxed Events",
   "msg": "05:55 am April 6, 2017\nSmall correction due to lack of edit button: There may be more than one timebox that remains unchanged, across both the Scrum and Nexus guides.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/7242/time-boxed-events",
   "last_post_date": "Last post 08:52 pm April 6, 2017"
  },
  {
   "title": "Time Boxed Events",
   "msg": "06:50 pm April 6, 2017\nTo everyone who has answered, If the question is:\nHow long is a Sprint Review?,\na. 4 hours.\nb. It depends on the length of the sprint.\nWould the answer be b. ?\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/7242/time-boxed-events",
   "last_post_date": "Last post 08:52 pm April 6, 2017"
  },
  {
   "title": "Time Boxed Events",
   "msg": "08:52 pm April 6, 2017\nThe Scrum Guide does explicitly note which of the Scrum Events have timeboxes that fluctuate with sprint duration, as well as what their duration would be in a one-month sprint. Below is the excerpt from the Sprint Review section of the guide:\n...This is a four-hour time-boxed meeting for one-month Sprints. For shorter Sprints, the event is usually shorter.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/7242/time-boxed-events",
   "last_post_date": "Last post 08:52 pm April 6, 2017"
  },
  {
   "title": "Who is absolutely necessary for one of these meetings?",
   "msg": "Messages",
   "url": "https://www.scrum.org/forum/scrum-forum/8011/who-absolutely-necessary-one-these-meetings",
   "last_post_date": "Last post 06:03 pm April 6, 2017"
  },
  {
   "title": "Who is absolutely necessary for one of these meetings?",
   "msg": "03:21 pm March 23, 2017\nHello\nwhich persons/roles are for one of these meetings absolutely necessary?\nI think these, but I am not sure.\nSprint Plannung Meeting: PO and Dev. Team\nDaily Scrum Meeting: Dev. Team\nSprint Review Meeting: PO, Dev. Team, Scrum Master, Stakeholder(s)\nSprint Retrospective: Dev. Team, Scrum Master\nBacklog Refinement Meeting: PO, Team\nBest regards\nPet",
   "url": "https://www.scrum.org/forum/scrum-forum/8011/who-absolutely-necessary-one-these-meetings",
   "last_post_date": "Last post 06:03 pm April 6, 2017"
  },
  {
   "title": "Who is absolutely necessary for one of these meetings?",
   "msg": "02:09 pm March 24, 2017\nWhat does the Scrum Guide say about attendance at these events? When it mentions \"Scrum Team\", which roles do you think are thereby referenced?\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8011/who-absolutely-necessary-one-these-meetings",
   "last_post_date": "Last post 06:03 pm April 6, 2017"
  },
  {
   "title": "Who is absolutely necessary for one of these meetings?",
   "msg": "05:28 am March 27, 2017\nScrum Team = {Product Owner, Dev Team, Scrum Master}\nSo, I think it's important to note that Scrum Team != Development Team.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8011/who-absolutely-necessary-one-these-meetings",
   "last_post_date": "Last post 06:03 pm April 6, 2017"
  },
  {
   "title": "Who is absolutely necessary for one of these meetings?",
   "msg": "11:52 am March 27, 2017\nThank you for the advice. Sprint plannung meeting was wrong. Backlog Refinement Meeting, I am not sure:\nSprint Review: The Scrum Team and stakeholders\nSprint Plannung Meeting: The Scrum Team\nSprint Retrospective: The Scrum Team\nDaily Scrum Meeting: Dev. Team\nBacklog Refinement Meeting: The Scrum Team\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8011/who-absolutely-necessary-one-these-meetings",
   "last_post_date": "Last post 06:03 pm April 6, 2017"
  },
  {
   "title": "Who is absolutely necessary for one of these meetings?",
   "msg": "03:03 pm April 6, 2017\nI'm wondering about Backlog Refinement because of:\nProduct Backlog refinement is the act of adding detail, estimates, and order to items in the Product Backlog. This is an ongoing process in which the Product Owner and the Development Team collaborate on the details of Product Backlog items. During Product Backlog refinement, items are reviewed and revised. The Scrum Team decides how and when refinement is done.\nSo does this mean PO and Dev team should be there, or the whole Scrum Team (so also the Scrum Master)?\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8011/who-absolutely-necessary-one-these-meetings",
   "last_post_date": "Last post 06:03 pm April 6, 2017"
  },
  {
   "title": "Who is absolutely necessary for one of these meetings?",
   "msg": "06:03 pm April 6, 2017\nBouke, what role does the Scrum Master play in these meetings? Does the Scrum Master have any stake or ownership over the backlogs? If not, are there other things the Scrum Master could facilitate with, such as rituals or tools support backlog refinement? And lastly, would the meeting be just as effective without the Scrum Master present?\nFrom the context, it sounds as though the Scrum Master is required to be present for the planning of when refinement happens, but not necessarily for the refinement itself. Those are two separate items.\nBut you specifically asked whether the whole scrum team should be there, to which I'd say yes. The Scrum Master as a facilitator and coach is valuable in every Scrum event, even if they aren't required to be there.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8011/who-absolutely-necessary-one-these-meetings",
   "last_post_date": "Last post 06:03 pm April 6, 2017"
  },
  {
   "title": "Story points vs hours",
   "msg": "Messages",
   "url": "https://www.scrum.org/forum/scrum-forum/8196/story-points-vs-hours",
   "last_post_date": "Last post 05:47 pm April 6, 2017"
  },
  {
   "title": "Story points vs hours",
   "msg": "08:13 am April 6, 2017\nHi,\ncould someone clarify. The Scrum Guide states\n\"Work planned for the first days of the Sprint by the Development Team is decomposed by the end of this meeting, often to units of one day or less.\"\nHowever many teams use story points for estimating tasks and not hours.\nHow do you reconcile the two? Do you select a story point value that would represent a day's work?\ne.g. all tasks should be decomposed to 8 points or less.\nI don't agree with using story points for user stories and hours for tasks, as it seems like it's over complicating things.",
   "url": "https://www.scrum.org/forum/scrum-forum/8196/story-points-vs-hours",
   "last_post_date": "Last post 05:47 pm April 6, 2017"
  },
  {
   "title": "Story points vs hours",
   "msg": "05:17 pm April 6, 2017\nAs I read it, the \"day's work\" is really just a rough estimate. The idea is just to break down tasks so they aren't in big chunks, but unlike the scrum events, this isn't a hard and fast maximum time. The guide doesn't say you *can't* have a story/task that lasts 4 days, only that it's usually more effective to break it down further.\nAs for actually reconciling points into hours, let's say you have a 1-month sprint. What value are you gaining by trying to determine if a task is going to take 8 hours versus 12 hours? Are story points intended to be used this way?\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8196/story-points-vs-hours",
   "last_post_date": "Last post 05:47 pm April 6, 2017"
  },
  {
   "title": "Story points vs hours",
   "msg": "05:47 pm April 6, 2017\nA Development Team should be able to forecast how much work they believe remains in their Sprint Backlog. The level of granularity should provide the transparency needed for Sprint control to be evidenced. Units of one day or less should allow the evidencing of progress during each Daily Scrum.\nEstimates are made so that a Development Team can forecast, during Sprint Planning, how much work they believes they can take on. Items should be sufficiently granular to allow progress and control to be evidenced every 24 hours. Those items may be tasks or user stories or some other construct. As long as the appropriate granularity is achieved, the method used in estimation is immaterial.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8196/story-points-vs-hours",
   "last_post_date": "Last post 05:47 pm April 6, 2017"
  },
  {
   "title": "Passed PSM I",
   "msg": "Messages",
   "url": "https://www.scrum.org/forum/scrum-forum/8087/passed-psm-i",
   "last_post_date": "Last post 05:41 pm April 6, 2017"
  },
  {
   "title": "Passed PSM I",
   "msg": "10:53 am March 30, 2017\nDear All,\nCleared PSM I certification exam last week with 97.5%, score of 78/80.\nI have decent experience working in Scrum based projects and Certified Agile Practitioner (PMI-ACP). I have taken PSM certification since I want to have something specific to Scrum. I must say I really learned a lot during this exam preparation, during reading the Scrum Guide, I could relate to my experience and found guide very structured way to understand the Scrum framework. To test my knowledge and to ascertain how I would fare in the exam, I have attempted all the Scrum open assessments till I get 100% repetitively. That gave me general understanding of the kind of questions in the exam. I have also attempted PSM I Quiz in Real mode by Mikhail Lapshin in order to get the feel of real exam with total 80 questions.\nSince this is the first certification exam I appeared which is self-proctored in my personal PC from the comfort of my home, so exam feeling was different & also little worried about the power & internet disconnection issue, But fortunately did not happen in my case, I found test GUI OK & questions were loading without prominent time lag, However some look & feel improvement can be made in Test software.\nI really enjoyed the exam with the kind of interesting questions coming in my way, few directly from the Scrum Open assessments. I was able to complete the 80 questions in 30 mins, with around 13-14 marked for review. Then I took some time to understand and answer those reviewed questions. Again cross checked all the 80 questions and managed to finish the test 4-5 mins before time, thinking better to finish it if done, than giving any chance for any disconnection or interruption to happen.\nQuestions were not easy but of intermediate difficulty level with some scenario based. It will really test your understanding of Scrum Guide and ability to apply it in real-world situations. But if you are prepared well & have some practical experience in Scrum, it is not difficult to pass this exam.\nAll the Best for the people who are PSM aspirants. Hope my feedback will help you in your preparation for your PSM exam and Scrum journey.\nThanks,\nPranab Chakraborty, PMP, PMI-ACP, ITIL v3F, PSM I",
   "url": "https://www.scrum.org/forum/scrum-forum/8087/passed-psm-i",
   "last_post_date": "Last post 05:41 pm April 6, 2017"
  },
  {
   "title": "Passed PSM I",
   "msg": "06:31 am April 1, 2017\nI have just passed PSM I. It was my first attempt and I am glad all the work paid off.\nDuring the exam, there was a latency in getting the next questions and it took me exactly 1 hour to answer all questions.\nIn addition to the Scrum Guide, which I went through at least 5 times, I did the open assessments on scrum.org and the mock exams on http://mlapshin.com/index.php/psm-quiz/ .This site has 80 questions in learning mode (with answers - excellent way to understand scrum) and real mode ( real time exam practice). I kept doing the exams until I had 100% result. Excellent site and I suggest everyone studying for the exam checks it. Lots of questions were very similar to the certification exam questions.\nAll the best for the people preparing for PSM certification.\nRegards,\nMare Ananijevska\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8087/passed-psm-i",
   "last_post_date": "Last post 05:41 pm April 6, 2017"
  },
  {
   "title": "Passed PSM I",
   "msg": "05:07 pm April 5, 2017\nJust passed PSM 1 today. Here my preparation\nRead the scrum guide from scrum.org which is very brief and concise\nThen run to the open assessments (PSM) on scrum.org several times, improving from initial 75%. Tried the other PSD and PSPO assessments as well to broaden knowledge.\nI found an excellent PSM 1 preparation course at management plaza (https://mplaza.pm/) including an online video course, a textbook and 3 full simulated exams.\nI first read the textbook which is very well-structured, then watched all 19 videos (some 180mins). The videos also where well-structured and explain Scrum very well. Finally I was running trough all 3 simulated exams, one per day and a repetition in the evening. The simulated exams give excellent feedback and explanation for all questions. I have collected all questions where I failed in a text file to improve by adaptation (a scrum principle :-)). So I could find out where I failed.\nThe Mplaza course also contains some valuable tips and hints for the exam.\nFinally read the textboolk again one day before the exam.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8087/passed-psm-i",
   "last_post_date": "Last post 05:41 pm April 6, 2017"
  },
  {
   "title": "Passed PSM I",
   "msg": "10:40 pm April 5, 2017\nanother good resource for prep is https://scrumstar.com/ worth paying the $20 for the bank of questions and resources they have. Progress & scores are presented in graphs which makes it transparent so you can inspect and adapt!!\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8087/passed-psm-i",
   "last_post_date": "Last post 05:41 pm April 6, 2017"
  },
  {
   "title": "Passed PSM I",
   "msg": "03:23 pm April 6, 2017\nI came here to make a similar post, but perhaps by adding to the thread it will serve as a better resource for others.\nI also recently passed PSM-I. Obviously there is some great advice in these forums, so I will try and not repeat those.\nIn addition to the standards of reading the Scrum Guide and taking the Open Assessments for Scrum Master and Product Owner, I used the following resources -\n- Read the book \"Software\" in 30 Days\n- Read the book \"Scrum\" by Sutherland\n- Read the book \"Scrum Narrative and PSM Exam Guide\" by Mohammed Musthafa Soukath Ali (and read his associated pocket guide)\n- Subscribed for one week to BostonAgileTrainings Mock tests, which I believe was $10. I did not use their training material.\n- Used the practice tests at mlapshin.com\nThere are other resources out there, and you really need to be careful about what you use. For example, I had a copy of the Scrum Master Training Manual from Mplaza that listed 6 Artifacts. A different version I had showed the correct listing of Artifacts. So, whatever your resources, make sure they are current and up to date.\nAdvice on the forum is pretty solid all the way around. Take the open assessments until you get 100% all the time. These not only give you a feel for the format of the test, but I probably had at least 10 or 15 questions that were straight from these open assessments, so those are pretty much free points.\nI really found the best resource to be the book by Ali. He actually tries to guide te reader into an active learning process, which is what you need to do. Essentially, for every sentence in the Scrum Guide, you need to ask yourself \"what does this mean in an applied setting, how would I actually use this?\" If you can begin to internalize that concept while reading it will take you a long ways. Conversely, while taking a test, you invert this idea and ask \"what concept in the Scrum Guide does this question speak to?\" The test is very much asking you to apply Scrum principles.\nI advise reading the Scrum Guide and Ali's book before reading the \"Scrum\" and \"Software in 30 Days\" books. I found the utility of the latter two books to be in the application and execution of Scrum, which is much easier to understand when you have the knowledge of the construction of Scrum. Not to mention that they are fun reads and show actual successful transformations to Scrum, which gives an added real world view.\nI also advise picking two or three sample exams and doing them until you pass with 90% or better. However, hold one set of sample exam in reserve. So, if you pick 3 exam sources, practice 2 of the 3 regularly. Then, right before taking the real exam is when you want to take the final set of practice exam. The reason is that the more you practice anything, the more you will start to learn those questions, those answers and that style of question. So, you might be scoring very high but that could be just because you are starting to learn the right answer. Holding one test in reserve will force you to apply knowledge in an unfamiliar setting, which is what you want before the real exam.\nI also advise as you engage our learning process, start to build yourself a \"1 pager\" based intially on the Scrum Guide. Sure, you can find plenty of one page slides online, but there is a part of learning that comes from your own captue and recreation of information. After you make this one pager, keep it next to you as you read other materials and use it as a reference, making notes and updating the one pager through the process.\nAs humans, we tend to prefer our learning to be specific, and fact based as opposed to concept based. This will throw you during the real exam if you aren't careful. You will see questions, and question patterns that look familiar but if you don't read every word, it will trip you up.\nFor example, you might see a question that asks about Done for a Product Backlog Item, which might be different than Done for a Sprint Backlog item. If you are disposed to thinking about DoD for Sprints and Sprint Backlog Items, you really need to think about this for a minute before answering. You need to read every word of a question and don't make the mistake of thinking that you recognize the question based on some key words and thus know the answer.\nAlso for example, you might see a question about treatment of Non Functional Requirements and you think \"oh man, I read three books and not one of them mentioned NFRs, what do I do?\" Again, the answer is to apply the principles of Scrum. I would argue that NFRs, Functional Requirements, or Whackadoo Blue Moon Chupacabra Requirements should all be treated the same way if they are delivering value to the customer.\nFinally, right before testing, re-read the Scrum Guide. As many others have said, every word and every sentence is chosen carefully. I did this and there were at least 3 questions on the exam that used language straight out of the Scrum Guide that I was able to recall because I had read it 10 minutes before.\nWell, that is a bit more than my 2 cents. I tried to give you some food for thought, but without revealing any testing specifics. I hope this helps and is a unique perspective.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8087/passed-psm-i",
   "last_post_date": "Last post 05:41 pm April 6, 2017"
  },
  {
   "title": "Who is allowed to attend a Daily Meeting",
   "msg": "Messages",
   "url": "https://www.scrum.org/forum/scrum-forum/5349/who-allowed-attend-daily-meeting",
   "last_post_date": "Last post 02:26 pm April 6, 2017"
  },
  {
   "title": "Who is allowed to attend a Daily Meeting",
   "msg": "10:40 am October 29, 2012\nScrum Guides states that: \"The Scrum Master enforces the rule that only Development Team members participate in the Daily Scrum. The Daily Scrum is not a status meeting, and is for the people transforming the Product Backlog items into an Increment.\"\nI want to make sure that I correctly understand the above statement in the way that it really means that NOONE (even the Product Owner) is allowed to attend a Daily Standup. If that is true - then what is the underlying cause of such a change. Before, the chicken could observe the meeting but were not allowed to speak.",
   "url": "https://www.scrum.org/forum/scrum-forum/5349/who-allowed-attend-daily-meeting",
   "last_post_date": "Last post 02:26 pm April 6, 2017"
  },
  {
   "title": "Who is allowed to attend a Daily Meeting",
   "msg": "10:45 am October 29, 2012\nHi Illya:\nI don't think anything has changed from your initial understanding. The key word in the Scrum guide is participate. Others who are not the Development Team can attend but they do not participate.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5349/who-allowed-attend-daily-meeting",
   "last_post_date": "Last post 02:26 pm April 6, 2017"
  },
  {
   "title": "Who is allowed to attend a Daily Meeting",
   "msg": "11:14 am October 29, 2012\nWell, the Product Owner usually doesn't understand what the developers are talking about, so he is useless anyway. Other stakeholders - especially managers - tend not to understand anything either but may feel the urge to \"manage something\" once they are there. So they are better off not being there.\nWhat I usually do is, I ask the Team at the beginning of the Daily Scrum if they allow certain spectators to participate. The spectators however are briefed in advance that they are not expected to talk.\nRegarding the PO: It largely depends on the person. If both he and the developers see a benefit in it, he of course is there (usually to answer questions right when they surface).\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5349/who-allowed-attend-daily-meeting",
   "last_post_date": "Last post 02:26 pm April 6, 2017"
  },
  {
   "title": "Who is allowed to attend a Daily Meeting",
   "msg": "11:27 am October 29, 2012\nI had a poor experience in the past when the PO was also the part of the Development Team thus he attended the meeting. The Team felt as they were reporting to the PO about the status.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5349/who-allowed-attend-daily-meeting",
   "last_post_date": "Last post 02:26 pm April 6, 2017"
  },
  {
   "title": "Who is allowed to attend a Daily Meeting",
   "msg": "03:23 pm October 29, 2012\nThis is interesting. I can definitely see a value of having the PO at the daily scrum. For example when deciding what stories to skip if the team realize that they cannot deliver all stories in a sprint or to discuss changing the scope of existing stories. To me this increase transparency for the PO. The scrum guide is quite clear on this though, the meeeting is for the dev. team only.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5349/who-allowed-attend-daily-meeting",
   "last_post_date": "Last post 02:26 pm April 6, 2017"
  },
  {
   "title": "Who is allowed to attend a Daily Meeting",
   "msg": "04:51 am October 30, 2012\nThis is interesting. I can definitely see a value of having the PO at the daily scrum. For example when deciding what stories to skip if the team realize that they cannot deliver all stories in a sprint or to discuss changing the scope of existing stories.\nFrederik, I believe these discussions are out of Daily Scrum agenda. And this is clearly defined in Scrum Guide too. The members of Development Team should answer only 3 questions, that's it. The rest is out of the Daily Scrum scope.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5349/who-allowed-attend-daily-meeting",
   "last_post_date": "Last post 02:26 pm April 6, 2017"
  },
  {
   "title": "Who is allowed to attend a Daily Meeting",
   "msg": "02:47 am October 31, 2012\nIn my experience it is the Development Team that only takes part in the Daily Scrum. However, after the Daily Scrum is over, other brief meetings are just added ad hoc. And there it is good to have the PO and maybe other stakeholders at hand.\n--> Distinguish between the Daily Scrum (where only the Development Team shall talk and shall talk to each other) and the subsequent discussions (where not the entire Development Team attends, but a lot of bilateral talks take place).\n--> It is up to the Scrum Master to delay such discussions for after the Daily Scrum and keep this timebox within 15 minutes. I even prefer shorter Daily Scrums.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5349/who-allowed-attend-daily-meeting",
   "last_post_date": "Last post 02:26 pm April 6, 2017"
  },
  {
   "title": "Who is allowed to attend a Daily Meeting",
   "msg": "03:29 am October 31, 2012\n--> Distinguish between the Daily Scrum (where only the Development Team shall talk and shall talk to each other) and the subsequent discussions (where not the entire Development Team attends, but a lot of bilateral talks take place).\nI absolutely agree with you. Also it's a good practice to have a parking lot when holding a Daily Scrum where you put the issues that can be discussed after the meeting.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5349/who-allowed-attend-daily-meeting",
   "last_post_date": "Last post 02:26 pm April 6, 2017"
  },
  {
   "title": "Who is allowed to attend a Daily Meeting",
   "msg": "04:56 pm November 2, 2012\n. However, after the Daily Scrum is over, other brief meetings are just added ad hoc.\nI've seen this as well, and I think it is generally a good thing, especially if it is mostly ad hoc meetings organized by the Dev Team. I've heard this concept called \"The after meeting.\"\nSome things potentially harmful to Scrum to watch out for with this practice:\n* Authoritarian type managers/execs/PO's who might \"hover\" to silently observe the Daily Scrum might be tempted to exert command and control in the after meetings, or require an after meeting every day to exert such control.\n* Be careful of developers discovering impediments the previous day but *waiting* until the DS/after meeting to deal with them. The best way to remove impediments is to handle them immediately if possible. Coach your team to always be removing impediments, and not just waiting until the DS to do so.\nOther than those two anti-patterns above, the \"after meeting\" is a great concept, and as Daniel said, it helps keep the DS itself very short. Even on larger(9-10 devs) distributed teams that I've coached, they were able to keep their DS to 10 minutes or less.\nRegarding the DS, it is also worth noting that a) there is no requirement that it be a standup meeting, though that is often a great practice and b) there is no Scrum rule against solving impediments within the DS. So long as you can keep it to the 15 minute time-box, and the conversation is on topic for DS content (yesterday/today/impediments), you can do whatever you want in that meeting.\n-------\nCharles Bradley\nhttp://www.ScrumCrazy.com\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5349/who-allowed-attend-daily-meeting",
   "last_post_date": "Last post 02:26 pm April 6, 2017"
  },
  {
   "title": "Who is allowed to attend a Daily Meeting",
   "msg": "07:06 am November 3, 2012\nI'll claim that the meeting is definitely not just about answering the 3 questions. With that agenda the daily standup runs the risk of turning into a status meeting. The daily scrum is a planning meeting for the next 24 hrs. Inspect what has been done since the last meeting and adapt accordingly to maximize the likelyhood of meeting the sprint goal. The PO must be involved e.g. when deciding what stories to skip in the current sprint and to me the daily scrum is the ideal time to have this discussion. If the team asks the PO to decide things like this after the DS the plan for the day may be useless. Don't you agree?\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5349/who-allowed-attend-daily-meeting",
   "last_post_date": "Last post 02:26 pm April 6, 2017"
  },
  {
   "title": "Who is allowed to attend a Daily Meeting",
   "msg": "03:24 pm November 3, 2012\n@Illya http://blog.appliedis.com/2012/10/09/daily-scrum-attack-the-day/\nScrum expects us to use our intellect. I wouldn't take those questions quite so literally. Plan for the next 24 hours.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5349/who-allowed-attend-daily-meeting",
   "last_post_date": "Last post 02:26 pm April 6, 2017"
  },
  {
   "title": "Who is allowed to attend a Daily Meeting",
   "msg": "12:26 pm November 6, 2012\nMy company has different definition of the Team. Product Owner and Scrum Master are full time members of the CORE team. Every one on the CORE team attend the daily scrum. Extend Team (ie architect, project manager) is invited, but do not participate. When Extend Team has questions, they will call the people involved (usually starting with Scrum Master) and discuss them after meeting. It's great collaboration and communication within and outside the team.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5349/who-allowed-attend-daily-meeting",
   "last_post_date": "Last post 02:26 pm April 6, 2017"
  },
  {
   "title": "Who is allowed to attend a Daily Meeting",
   "msg": "12:58 pm November 7, 2012\nFredrik,\nI'll claim that the meeting is definitely not just about answering the 3 questions. With that agenda the daily standup runs the risk of turning into a status meeting. The daily scrum is a planning meeting for the next 24 hrs. Inspect what has been done since the last meeting and adapt accordingly to maximize the likelyhood of meeting the sprint goal.\n^^ Agree 110%, and this is a concept that is not understood by many practitioners as they focus too much on the 3 questions and item status.\nThe PO must be involved e.g. when deciding what stories to skip in the current sprint...\n^^ True, and the whole Dev Team must also be involved.\n...and to me the daily scrum is the ideal time to have this discussion...\n^^ Is it always the ideal time to have that discussion?\nIf the team asks the PO to decide things like this after the DS the plan for the day may be useless. Don't you agree?\nLet me take your point here one more step. Let's say that the team needs a PO decision on what things to add or drop from a sprint. As we know, the Dev Team and PO must be present when this decision is made. Let's say your Daily Scrum is at 10am. At 1pm, the Dev Team realizes it might need to drop an item from the sprint.\nShould that team wait until 10am the next day to have that discussion?\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5349/who-allowed-attend-daily-meeting",
   "last_post_date": "Last post 02:26 pm April 6, 2017"
  },
  {
   "title": "Who is allowed to attend a Daily Meeting",
   "msg": "02:23 pm November 8, 2012\nCharles,\nI am not saying that the PO must attend the daily scrum but I am questioning the reason why the scrum guide explicitly states that the DS is for dev team only. I am guessing it's to prevent the DS from becoming just a discussion/negotiation between the PO and the dev team, allowing no time for the dev team to plan their work.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5349/who-allowed-attend-daily-meeting",
   "last_post_date": "Last post 02:26 pm April 6, 2017"
  },
  {
   "title": "Who is allowed to attend a Daily Meeting",
   "msg": "03:23 pm November 8, 2012\nFredrik,\nbut I am questioning the reason why the scrum guide explicitly states that the DS is for dev team only.\nFredrik, I think you are very right to ask this question, and it's a good one. The short answer is I don't know exactly why the Scrum Guide was written that way, as I was not involved in writing that part of the Scrum Guide.(or any other part, to date, though I have given some feedback to Scrum.org on occasion).\nHowever, here is my guess, based on my Scrum knowledge and experiences:\n* The Dev Team(DT) has no other Scrum event where it is just them exclusively, so to ensure that they have every reasonable opportunity at self organization, the Daily Scrum was explicitly described as only the DT participates.\n** Having anyone else participate, especially people who might be viewed as authority figures (SM, PO, Managers, etc) carries the risk of completely destroying the self organization of the DT. Giving any of these authority figures even the slightest daylight in the Scrum Guide would probably encourage them to try and participate. I think it is ok for the SM to facilitate the DS for a team that is learning, but facilitating is not the same as participating(as in, answering the 3 questions, etc).\n*** Along this theme, having any other authoritative figure present also runs the risk of the DS turning into a status or \"report up\" meeting, which is definitely NOT what we want.\n** I'll go one step further. I'd prefer that no one else(besides the DT, and the SM when needed) be *present* at the DS, because it discourages transparency. People who are being observed by an authority figure will not be as transparent as those who are free from such observation.\n* The purpose of the DS is to inspect and adapt the plan. Many studies have shown that when a team is empowered to self organize to provide it's own plan, it is much more likely to execute that plan well and on time. Introducing others means reducing the empowerment, IMO.\n** The PO has no role in coming up with the plan -- only the ordering, definition(acceptance tests), and clarification of PBI's. The PO has all kinds of influence over the \"WHAT\", but only the Dev Team owns \"THE HOW\". Therefore, one might say that the DS is for the \"HOW', and not for the \"WHAT\".\n* Since we often want the PO to be someone empowered, from the business side of the house, it may be impractical to require them to come to the Daily Scrum -- because of their business side duties. OTOH, IMO, there is no such thing as too much communication between the PO and team. IME, very few Scrum teams can get along well without a lot of interaction with the PO. Maybe the DS is just not the appropriate time for it. Let's remember, the DS is only 15 minutes, so there *are* another 7 hours and 45 minutes of the day(typical US work day) when the PO can collaborate with the DT. I mean, you could have a PO Q&A just before your DS(so long as it does not impact the DS in any way -- and that includes the DS start time) every day, if you're really worried about PO decision affecting the plan. However, the reality is your team should be interacting with the PO *whenever* the PO is needed. While the PO need not be present all day every day, they should be pretty highly available all day every day, IMO. In summary, there is a very wide range of how much actual time a PO spends with a team or managing the backlog. As such, taking them out of having to participate in the DS allows for POs who also spend a fair amount of their time with stakeholders or in non Scrum team/business activities.\nMany of the obstacles you mentioned can be solved in other ways besides at the DS. The Scrum Framework encourages you do to do whatever you can to solve these issues on your own\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5349/who-allowed-attend-daily-meeting",
   "last_post_date": "Last post 02:26 pm April 6, 2017"
  },
  {
   "title": "Who is allowed to attend a Daily Meeting",
   "msg": "03:26 pm November 8, 2012\nWhoops. I hit the \"submit\" button too soon.\nThe Scrum Framework encourages you do to do whatever you can to solve these issues on your own\nShould read:\nThe Scrum Framework encourages you do to do whatever you can to solve these issues on your own, without changing the framework itself. As the Scrum Guide says, \"Scrums roles, artifacts, events, and rules are immutable and although implementing only parts of Scrum is possible, the result is not Scrum.\"\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5349/who-allowed-attend-daily-meeting",
   "last_post_date": "Last post 02:26 pm April 6, 2017"
  },
  {
   "title": "Who is allowed to attend a Daily Meeting",
   "msg": "01:43 pm November 11, 2012\nHmm, same topic, different thread. Here's my view, as stated in the other thread:\nI always tell that the meeting is mandatory for the Development Team, as you say. It is after all their meeting, their inspection of their work.\nI tell that Scrum Master and Product Owner are allowed to join the meeting. This seems to have a positive effect on the team; it shows they are connected and committed as Scrum Team members. But if they join, behave as every other Scrum Team member. So, don't start leading the meeting. I ask them to answer the 3 questions from their perspective. It keeps the others informed, and it helps to keep the Product Owner to be accurately informed which is quite helpful for his/her stakeholder management.\nAnd don't forget that the 3 questions are indeed only a means to get the right information in the open. Just formally answering the 3 questions for the sake of it isn't helping either.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5349/who-allowed-attend-daily-meeting",
   "last_post_date": "Last post 02:26 pm April 6, 2017"
  },
  {
   "title": "Who is allowed to attend a Daily Meeting",
   "msg": "04:41 am November 12, 2012\nCharles,\nThanks for your detailed reply. I am inclined to agree on most parts.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5349/who-allowed-attend-daily-meeting",
   "last_post_date": "Last post 02:26 pm April 6, 2017"
  },
  {
   "title": "Who is allowed to attend a Daily Meeting",
   "msg": "04:28 pm November 12, 2012\nFredrik,\nYou're welcome, and I'm glad you found value. It's an excellent question, which leads me to believe you are on a good path towards good Scrum. Keep asking the tough questions!\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5349/who-allowed-attend-daily-meeting",
   "last_post_date": "Last post 02:26 pm April 6, 2017"
  },
  {
   "title": "Who is allowed to attend a Daily Meeting",
   "msg": "02:06 am November 20, 2012\nI am new to Scrum and was reading the Scrum Guideline. In page #10 it states 'Every day, the Development Team should be able to explain to the Product Owner and Scrum Master how it intends to work together as a self-organizing team to accomplish the goal and create the anticipated Increment in the remainder of the Sprint.'\nMy question here is, how does/should this communication take place, during the Daily Scrum or via email or any other Status Reporting method as we see project management methodologies?\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5349/who-allowed-attend-daily-meeting",
   "last_post_date": "Last post 02:26 pm April 6, 2017"
  },
  {
   "title": "Who is allowed to attend a Daily Meeting",
   "msg": "07:33 am November 20, 2012\n\"Should be able to\"\nThis is illustrating the purpose of the Daily Scrum, not a reporting\nstructure or explicit activity that must occur.\nOn Tue, Nov 20, 2012 at 2:06 AM, <ScrumForum@scrum.org> wrote:\n>\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5349/who-allowed-attend-daily-meeting",
   "last_post_date": "Last post 02:26 pm April 6, 2017"
  },
  {
   "title": "Who is allowed to attend a Daily Meeting",
   "msg": "11:54 pm November 20, 2012\nI agree with Ryan -- this is simply a description of the \"outcome\" or \"acceptance criteria\" for a healthy Daily Scrum.\nI also agree with that Ryan that this is not an explicit activity, though I think occasionally it is ok for the PO and/or SM to request that the Dev Team give a 1-2 minute summary of their plan for achieving the Sprint Goal and Increment, especially when they have trouble seeing what that plan might be. In short, I'd probably only ask for the summary once a sprint every now and then, and I would NOT do it during the DS. I'd probably do it just after the DS is completely over.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5349/who-allowed-attend-daily-meeting",
   "last_post_date": "Last post 02:26 pm April 6, 2017"
  },
  {
   "title": "Who is allowed to attend a Daily Meeting",
   "msg": "12:34 am November 21, 2012\nThanks Ryan and Charles, for your input. This clarifies my doubt.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5349/who-allowed-attend-daily-meeting",
   "last_post_date": "Last post 02:26 pm April 6, 2017"
  },
  {
   "title": "Who is allowed to attend a Daily Meeting",
   "msg": "03:31 pm November 21, 2012\nSunandajit,\nYou're welcome. Happy to help!\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5349/who-allowed-attend-daily-meeting",
   "last_post_date": "Last post 02:26 pm April 6, 2017"
  },
  {
   "title": "Who is allowed to attend a Daily Meeting",
   "msg": "02:20 pm April 6, 2017\nI guess there is one point that is mostly misunderstood here. The question is about the below statement from scrum guide \"The Scrum Master enforces the rule that only Development Team members participate in the Daily Scrum\".\nThey key to come to terms with the above statement is the word \"PARTICIPATE\" !. Please note that Both the PO and the scrum master can still ATTEND the daily scrum for their own interests (The PO to be readily available clarify the requirements and/or to adjust the Sprint backlog as needed by the development team's decision and the SM to make sure the team is having the daily scrum and serving the intended purpose of the meeting)\nOnly the development team participates and they can even invite the needed parties they think can help resolve the impediments or set the decisions for the next 24 hrs. Basically this event is OWNED by the development team. SM's job is to make sure they are owning it and having it everyday. His job is not to manage it or them!\nBoth the SM and the PO SERVE the development team in all ways possible to help them achieve what they plan for the next 24 hrs.\nI hope this clarifies the responsibility and interaction levels of the three scrum roles (SM, PO and development team member) in a daily scrum!\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5349/who-allowed-attend-daily-meeting",
   "last_post_date": "Last post 02:26 pm April 6, 2017"
  },
  {
   "title": "A change to the Sprint Backlog during the Sprint",
   "msg": "Messages",
   "url": "https://www.scrum.org/forum/scrum-forum/5894/change-sprint-backlog-during-sprint",
   "last_post_date": "Last post 02:21 pm April 6, 2017"
  },
  {
   "title": "A change to the Sprint Backlog during the Sprint",
   "msg": "02:11 am May 27, 2014\nHi there,\nThere's a question in the open assessment which I don't understand:\nThe Development Team should not be interrupted during the Sprint. The Sprint Goal should remain intact. These are conditions that foster creativity, quality and productivity. Based on this, which of the following is false?\nA) The Product Owner can help clarify or optimize the Sprint when asked by the Development Team.\nB) The Sprint Backlog and its contents are fully formulated in the Sprint Planning meeting and do not change during the Sprint.\nC) As a decomposition of the selected Product Backlog Items, the Sprint Backlog changes and may grow as the work emerges.\nD) The Development Team may work with the Product Owner to remove or add work if it finds it has more or less capacity than it expected.\nThe correct answer for this question was the one I immediately dropped as surely not correct, and it is B.\nReally Sprint Backlog does not change during the Sprint?\nI can see in the Scrum Guide that the Development Team may negotiate with the Product Owner the scope of the Sprint Backlog within the Sprint.",
   "url": "https://www.scrum.org/forum/scrum-forum/5894/change-sprint-backlog-during-sprint",
   "last_post_date": "Last post 02:21 pm April 6, 2017"
  },
  {
   "title": "A change to the Sprint Backlog during the Sprint",
   "msg": "02:45 am May 27, 2014\nRead the question carefully, up to the last word before the question mark ;)\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5894/change-sprint-backlog-during-sprint",
   "last_post_date": "Last post 02:21 pm April 6, 2017"
  },
  {
   "title": "A change to the Sprint Backlog during the Sprint",
   "msg": "01:42 pm May 27, 2014\nAs Ludwig says, the question asks you to identify which statement is *false*.\nThe only one that is false is B, because there is every expectation that the Sprint Backlog will change during the Sprint.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5894/change-sprint-backlog-during-sprint",
   "last_post_date": "Last post 02:21 pm April 6, 2017"
  },
  {
   "title": "A change to the Sprint Backlog during the Sprint",
   "msg": "02:06 am May 28, 2014\naffff..... :)\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5894/change-sprint-backlog-during-sprint",
   "last_post_date": "Last post 02:21 pm April 6, 2017"
  },
  {
   "title": "A change to the Sprint Backlog during the Sprint",
   "msg": "09:59 pm May 28, 2014\nThe Sprint Backlog and its contents are fully formulated in the Sprint Planning meeting\nIt may be that the Sprint Backlog is fully formulated during the Sprint Planning Meeting, but as I've studied the material, there seems to be an emphasis that the Dev Team need not breakdown every story committed to in the Sprint during the Sprint Planning Meeting. Once there are enough stories broken down into tasks for a few days of work, the Dev Team get start working on those, while other stories are decomposed during the Sprint. You would want to breakdown as many as you can during the Sprint Planning Meeting.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5894/change-sprint-backlog-during-sprint",
   "last_post_date": "Last post 02:21 pm April 6, 2017"
  },
  {
   "title": "A change to the Sprint Backlog during the Sprint",
   "msg": "01:20 pm April 6, 2017\nyes, the correct answer is B as the questions asks you to select which statement is FALSE\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5894/change-sprint-backlog-during-sprint",
   "last_post_date": "Last post 02:21 pm April 6, 2017"
  },
  {
   "title": "Minimum length of a sprint and sprint goal",
   "msg": "Messages",
   "url": "https://www.scrum.org/forum/scrum-forum/8166/minimum-length-sprint-and-sprint-goal",
   "last_post_date": "Last post 05:30 am April 6, 2017"
  },
  {
   "title": "Minimum length of a sprint and sprint goal",
   "msg": "06:08 pm April 4, 2017\nHi\nI was reading a post on the forum related to the sprint goal where the user expressed concern by stating that they couldn't begin a sprint if they did not have multiple sprint goals, as the items within the sprint backlog would all not tie back to a single sprint goal.\nThis led me to ask this question i.e. What is the minimum length of a sprint?\nIs it possible that during the process of refining the product backlog there may be items that cannot be grouped to achieve a single sprint goal? How do we deal with such items?\nCan the sprint goal be tweaked or would that make it obsolete?",
   "url": "https://www.scrum.org/forum/scrum-forum/8166/minimum-length-sprint-and-sprint-goal",
   "last_post_date": "Last post 05:30 am April 6, 2017"
  },
  {
   "title": "Minimum length of a sprint and sprint goal",
   "msg": "04:51 am April 5, 2017\nOfficially there is no clearly defined minimum, but you have to consider the time it takes to hold retrospectives, planning, and backlog grooming as well as the (presumably largest) phase of actually doing the work. Also, since new sprints start at the end of the previous sprint, having sprint durations that aren't a multiple of 5 days means having them start and end on different days. Inconsistent timeboxes are not ideal.\nIn my opinion, I'd draw the line at 1 week (5 days) as a practical minimum. Yes, you can technically manage shorter sprints, but I think Scrum loses a lot of its effectiveness when you attempt to do this.\nAs for the second question, regarding what happens if sprint backlog items don't seem to match a sprint goal, my understanding is that you could potentially approach it in three different ways:\nThe Sprint Goal doesn't accurately reflect the goal for the sprint, and should be revised.\nThe original Sprint Goal is no longer relevant, and the sprint should be canceled.\nThe Sprint Backlog items don't match the Sprint Goal, and should be left in the Product Backlog for a future sprint.\nThe Sprint Goal is an objective that will be met within the Sprint through the implementation of the Product Backlog, and it provides guidance to the Development Team on why it is building the Increment.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8166/minimum-length-sprint-and-sprint-goal",
   "last_post_date": "Last post 05:30 am April 6, 2017"
  },
  {
   "title": "Minimum length of a sprint and sprint goal",
   "msg": "04:40 pm April 5, 2017\nMy question was based more on the assumption that there are no other PBIs that can relate to the sprint goal in such a way that multiple PBIs can be picked up from the product backlog to successfully run a 1 week sprint. What if we have multiple items that are not related to a single goal and are estimated to be a few hours worth of work. Would we not waste an entire sprint for such small tasks? Then, in such a case would we have to make an exception like a Scrumbut?\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8166/minimum-length-sprint-and-sprint-goal",
   "last_post_date": "Last post 05:30 am April 6, 2017"
  },
  {
   "title": "Minimum length of a sprint and sprint goal",
   "msg": "04:48 pm April 5, 2017\nIn the situation you describe, is there sufficient complexity left to deal with which would make Scrum useful?\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8166/minimum-length-sprint-and-sprint-goal",
   "last_post_date": "Last post 05:30 am April 6, 2017"
  },
  {
   "title": "Minimum length of a sprint and sprint goal",
   "msg": "04:54 pm April 5, 2017\n@Ian Mitchell, Good point! I would say there isn't much complexity, therefore would such items have to be dealt by another framework like Kanban?\nThat leads me to ask, what if there are no more items left in the product backlog (assuming that the product still exists)? Is such a scenario possible?\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8166/minimum-length-sprint-and-sprint-goal",
   "last_post_date": "Last post 05:30 am April 6, 2017"
  },
  {
   "title": "Minimum length of a sprint and sprint goal",
   "msg": "05:10 pm April 5, 2017\nConceptually, the Product Backlog will exist for as long as the product exists, although at times it may be empty.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8166/minimum-length-sprint-and-sprint-goal",
   "last_post_date": "Last post 05:30 am April 6, 2017"
  },
  {
   "title": "Minimum length of a sprint and sprint goal",
   "msg": "07:29 pm April 5, 2017\nBased on that there would be no sprints until the product backlog has items again, is that right?\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8166/minimum-length-sprint-and-sprint-goal",
   "last_post_date": "Last post 05:30 am April 6, 2017"
  },
  {
   "title": "Minimum length of a sprint and sprint goal",
   "msg": "04:25 am April 6, 2017\nI wouldn't think so, Steve. What would your potentially releasable increment look like if you had no backlog items?\nIf you're wondering about the technical \"scrum way\" to handle this, the Scrum Guide would prefer that you cancel the sprint for having an obsolete (nonexistent) sprint goal, over and over. Or, it would tell you to close out the project and open a new project for the same product once have enough backlog items to perform a couple of sprints. If you think those options sound inefficient and messy, you're right. Scrum doesn't play nicely with \"downtime.\"\nIn reality, where time and money aren't infinite, this wouldn't work very well.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8166/minimum-length-sprint-and-sprint-goal",
   "last_post_date": "Last post 05:30 am April 6, 2017"
  },
  {
   "title": "Minimum length of a sprint and sprint goal",
   "msg": "04:33 am April 6, 2017\nThe Development Team may continue Sprinting but for a different product. There's nothing to stop teams from alternating between products in different Sprints according to demand. The Sprint Goal in such cases may be to service enhancements for a particular product being worked on. The complex environment may thus lie not in the specific product but rather in the range of products to be supported.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8166/minimum-length-sprint-and-sprint-goal",
   "last_post_date": "Last post 05:30 am April 6, 2017"
  },
  {
   "title": "Minimum length of a sprint and sprint goal",
   "msg": "05:30 am April 6, 2017\n\"The complex environment may thus lie not in the specific product but rather in the range of products to be supported\"\nThat's a good way of putting it, and in that case, I agree with you, Ian. Thank you for the clarification. In a complex environment (and not a complex single product), moving the team over to another product would meet the definitions of Scrum a lot more cleanly, and probably be the preferable way to handle it over the much messier product-based methods I had suggested.\nI also see the primary cause for my confusion, which I'll share for anyone who falls into the same thought process. Scrum guide states both:\n\"Scrum is a framework for developing and sustaining complex products.\"\nand\n\"Scrum (n): A framework within which people can address complex adaptive problems\"\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8166/minimum-length-sprint-and-sprint-goal",
   "last_post_date": "Last post 05:30 am April 6, 2017"
  },
  {
   "title": "It's not difficult to pass PSM 1",
   "msg": "Messages",
   "url": "https://www.scrum.org/forum/scrum-forum/8028/its-not-difficult-pass-psm-1",
   "last_post_date": "Last post 02:17 pm April 6, 2017"
  },
  {
   "title": "It's not difficult to pass PSM 1",
   "msg": "04:34 am March 26, 2017\nI cleared the exam yesterday and I wanted to share my take on - \"How I cleared the exam!\"\nWell, I got 89%. I might have been a little slow in reading the questions/options and ended up not having enough time to review few flagged answers.\nBut yes, I cleared the exam at the first go.\nIt all started here - https://scrum101.com/ - and It's free. When you sign up, you will start receiving an email per day from Kane Mar with a link to short videos which are less than 5 minutes.\nHere's how I prepared for the exam.\n1. Printed out the Scrum guide\na. Read the Scrum Guide on the train while heading to work.\nb. Tried Scrum open assessment and no doubt, didn't pass!\nc. Read the guide again, this time managed to get close to 90%.\nd. Learnt which questions I was going wrong from feedback which you get after completing Scrum open assessment.\nc. While looking for free study material, got hold of this book -\" The Scrum Master Training Manual\" by Nader K. Rad and Frank Turley ( Management Plaza). it's free and just 35 pages.\nf. Tried Open Scrum assessment and got 100%. After which I was consistently hitting a 100%\ng. Tried Open PO assessment (15 Qs) and got 70% which made me realise that I was not ready yet So,\nh. Read Scrum Guide again and got 100% consistently in Open PO assessment as well.\nRead the Scrum guide like 6 times before I took the exam and yes, I didn't buy any other material to practice.\nYou may have to unlearn few things that you know about Scrum and Please don't read multiple books this will only help you get confused. You just need to understand Scrum Guide.\nHope this helps anyone taking the exam.",
   "url": "https://www.scrum.org/forum/scrum-forum/8028/its-not-difficult-pass-psm-1",
   "last_post_date": "Last post 02:17 pm April 6, 2017"
  },
  {
   "title": "It's not difficult to pass PSM 1",
   "msg": "05:17 pm March 27, 2017\nCongratulations Pradeep.\nCan you state that you were able to answer questions on scaled scrum or should we assume that you did not get any questions on scaled scrum/Nexus?. You did not mention that you read the Nexus guide from Scrum.org.\nA lot of people talk about Mplaza question sets. Is it really necessary to be sure of a pass?. After all, the more tests, the better the confidence but if the test questions don't quite mimic the real test in language and complexity, then it might not be worthwhile.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8028/its-not-difficult-pass-psm-1",
   "last_post_date": "Last post 02:17 pm April 6, 2017"
  },
  {
   "title": "It's not difficult to pass PSM 1",
   "msg": "06:04 am March 29, 2017\nThanks Cecil.\nI didn't read Nexus guide and I can't comment if there were questions on scaled scrum in the assessment. The way I thought before taking the exam was - \" It's Scrum Level 1 assessment and really shouldn't have questions outside of scrum guide\".\nScaled scrum is an intermediate-level assessment and I don't think Scrum.org should include questions from Nexus guide in PSM 1 (Level 1).\nWell, For PSM 1 assessment - Scrum Guide and Open assessment are good.\nFew questions would show up in the exam where you can save some time and utilize it on another question.\nMore practice will definitely help you get quicker in the exam.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8028/its-not-difficult-pass-psm-1",
   "last_post_date": "Last post 02:17 pm April 6, 2017"
  },
  {
   "title": "It's not difficult to pass PSM 1",
   "msg": "03:38 pm March 30, 2017\nI have been attempting the Scrum practitioner test of 15 questions and I repeatedly get 86.7%. I am not able to figure out what answers are incorrect and I am looking for some help. If anybody is willing to take a look and let me know what is incorrect. There are 2 that are presumably wrong. I have saved the screen shots.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8028/its-not-difficult-pass-psm-1",
   "last_post_date": "Last post 02:17 pm April 6, 2017"
  },
  {
   "title": "It's not difficult to pass PSM 1",
   "msg": "06:50 pm March 30, 2017\nHappy to help !\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8028/its-not-difficult-pass-psm-1",
   "last_post_date": "Last post 02:17 pm April 6, 2017"
  },
  {
   "title": "It's not difficult to pass PSM 1",
   "msg": "06:52 pm March 31, 2017\nThanks Manvender. How do I get in touch to send the file with screenshots.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8028/its-not-difficult-pass-psm-1",
   "last_post_date": "Last post 02:17 pm April 6, 2017"
  },
  {
   "title": "It's not difficult to pass PSM 1",
   "msg": "11:36 pm April 2, 2017\nI passed the PSM 1 my first time with 100%\nThe initial drive came from a three day \"training\" by my employer. As I challenged the Agile Coach about the material being presented, I found issues with what was being sold. There was no mention of the Manifesto for Agile Software Development or The Scrum Guide.\nSoon after, I found and read The Scrum Guide. I read it several times, challenging myself to understand the \"why\" of each of the roles, events, artifacts, and the rules. I would ask myself, \"What benefits would be lost if XYZ were removed from the framework?\"\nMuch as the Manifesto came after Scrum, I found it and invested the similar effort into understanding it. The history provided at that site was beneficial. It was a common sense set of values and principles very easily consumed.\nThe Open Assessments were a great test of my knowledge. If I missed a question, I reviewed the applicable areas of The Scrum Guide and took time to further evaluate my understanding. Other sources seemed to contradict or diminish the simple beauty that was the power of the Scrum framework.\nOf course each person has their own journey to enlightenment. I wish y'all well. My hope is that true appreciation and understanding can flourish, so that I can see the improvement in the people and organizations around me.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8028/its-not-difficult-pass-psm-1",
   "last_post_date": "Last post 02:17 pm April 6, 2017"
  },
  {
   "title": "It's not difficult to pass PSM 1",
   "msg": "04:49 pm April 3, 2017\nI passed PSM 1 with 99% (1 answer was incorrect). I read and re-read Scrum Guide multiple times. After a first couple of reads, I gave the http://mlapshin.com/index.php/psm-quiz/. The test helped reveal that I should be reading the Scrum Guide more closely which I did and then attempted the PSM 1 Open Assessment. I did not get 100% which made me look for more resources. From this forum I came across a book: Scrum Narrative and PSM Exam Guide by M.M Soukath Ali. I bought this over Amazon and gave it a few days to read. It helped as it slowed down my pace a bit, letting the concepts sink in better. Moreover the qns after every page or so, helped in active learning. Its full fledged assessment at the end also helped challenge the understanding of concepts. I read the Scrum Guide again after this book and tried PSM Open assessment and now I scored 100%. I checked myself over a couple of days giving PSM Open assessments and consistently got 100%. Thinking I might not be covering well inspite of getting 100% in PSM Open Assessment, I gave the PSPO Open assessment and Nexus Open assesment. I did well in PSPO (got 2 wrong) but rather poorly in Nexus. I didnt try Nexus again. I also tried the Developer Open assessment and did very poorly there but I can for sure say that its not needed for PSM 1 exam. Even Nexus is not needed but it will not harm if you give the test once just so that you are aware of some concepts. PSPO Open assessment is not a must have but doing it once will help in building the confidence. I did not use any other resources other than the ones mentioned above. I will suggest going through some other scrum.org resources (which are very quick read) towards the end will help revise the concepts - https://www.scrum.org/resources/ways-learn-about-scrum.\nBest of luck in passing PSM 1 certifications for those who are planning to do it.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8028/its-not-difficult-pass-psm-1",
   "last_post_date": "Last post 02:17 pm April 6, 2017"
  },
  {
   "title": "It's not difficult to pass PSM 1",
   "msg": "10:13 pm April 4, 2017\nI also found it useful to read the Scrum and Developer glossary. Filter for them under Resources.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8028/its-not-difficult-pass-psm-1",
   "last_post_date": "Last post 02:17 pm April 6, 2017"
  },
  {
   "title": "It's not difficult to pass PSM 1",
   "msg": "04:13 am April 6, 2017\nHI ,\nI followed all the post and got only 9 out of 15 from srum practioner exam.. I have already failed once in PSm and does not want to leave any stone unattended. Can you please go thru the below link and let me know the questions I have gone wrong.. pl\nhttps://www.scrum.org/forum/scrum-forum/8181/scrum-practioner-questions\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8028/its-not-difficult-pass-psm-1",
   "last_post_date": "Last post 02:17 pm April 6, 2017"
  },
  {
   "title": "Development KPIs and Scrum?",
   "msg": "Messages",
   "url": "https://www.scrum.org/forum/scrum-forum/8192/development-kpis-and-scrum",
   "last_post_date": "Last post 12:39 am April 6, 2017"
  },
  {
   "title": "Development KPIs and Scrum?",
   "msg": "12:39 am April 6, 2017\nThe management of our company is asking us to provide KPIs to evaluate the effectiveness of our Scrum team.\nWe provide the number of planned PBIs, the number of PBIs realized, the number of story points planned, the number of story points realized and the velocity.\nI am not at all convinced of the value of these KPIs in order to evaluate our team. I believe more than value added to the product, customer satisfaction and return on investment are more important points.\nIn your opinion, which KPI should be used to measure the effectiveness of a team.\nP.S. Sorry for my english!",
   "url": "https://www.scrum.org/forum/scrum-forum/8192/development-kpis-and-scrum",
   "last_post_date": "Last post 12:39 am April 6, 2017"
  },
  {
   "title": "Open Invitation to Sprint Review",
   "msg": "Messages",
   "url": "https://www.scrum.org/forum/scrum-forum/8186/open-invitation-sprint-review",
   "last_post_date": "Last post 06:38 pm April 5, 2017"
  },
  {
   "title": "Open Invitation to Sprint Review",
   "msg": "03:51 pm April 5, 2017\nThe Scrum Guide explicitly states that the Sprint Review's attendees include the Scrum Team and key stakeholders invited by the PO.\nOne, does this mean to you that the Review is limited to these attendees?\nTwo, if you do take it as the Review is limited to these attendees, what reasons do you think there are for not wanting particular attendees?\nTo provide some context, my organisation is trying to make Sprint Reviews open to everyone in the business. While the idea floats around, I want to ensure we are not slipping into some potentially detrimental practice. I'm struggling to come up with any solid reasons against this idea, but I'm wary they might exist down to the tone of the Scrum Guide.\nIf anyone could provide share actual experiences with this, that'd be great!\nThanks!",
   "url": "https://www.scrum.org/forum/scrum-forum/8186/open-invitation-sprint-review",
   "last_post_date": "Last post 06:38 pm April 5, 2017"
  },
  {
   "title": "Open Invitation to Sprint Review",
   "msg": "04:19 pm April 5, 2017\nWhat are the consequences of this likely to be for focus during the session, and on the ability of the Scrum Team to inspect and adapt?\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8186/open-invitation-sprint-review",
   "last_post_date": "Last post 06:38 pm April 5, 2017"
  },
  {
   "title": "Open Invitation to Sprint Review",
   "msg": "04:24 pm April 5, 2017\nFor the most part, Scrum doesn't really ban anyone from any meeting, but it defines the members that would have participant roles. While a Product Owner can sit in on a Daily Scrum, for example, they're intended to be a silent observer and not a participant. They can take their comments to a sidebar or another scrum event, but they shouldn't be taking up the 15-minute timebox with stuff they want to talk about.\nWhen you add significant transparency to your events, There are two concerns I'd have with this:\nYou're working with teams of people. People often act on their \"best behavior\" when an executive is sitting there, and may not want to make waves or complain about genuine problems for fear of the high visibility. Scrum events lose their value when everyone wants to look like a \"team player\" and a \"yes man\" rather than actually address problems and progress in Scrum.\nPeople like to interject their own thoughts, even if they're supposed to be attending as silent observers. Sometimes as a Scrum Master, you may have to ask your observers and even optional team members to leave a Scrum event entirely if they're being disruptive. Those interruptions are often based on good intent, so it can be a difficult situation to traverse.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8186/open-invitation-sprint-review",
   "last_post_date": "Last post 06:38 pm April 5, 2017"
  },
  {
   "title": "Open Invitation to Sprint Review",
   "msg": "06:38 pm April 5, 2017\nYep, you're both right (I know why you're asking, Ian) and I agree there is the observer effect and potential focus loss, etc. with having a completely open review.\nI have people quite high up the management chain who are for an open review, and would certainly argue it favours 'transparency', 'honesty' and so forth. So I'd like to hear people's experiences with it. My reasoning alone is likely not going to be enough, so if there are actual examples I can use then it might start to help my effort.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8186/open-invitation-sprint-review",
   "last_post_date": "Last post 06:38 pm April 5, 2017"
  },
  {
   "title": "non-functional requirements",
   "msg": "Messages",
   "url": "https://www.scrum.org/forum/scrum-forum/7314/non-functional-requirements",
   "last_post_date": "Last post 05:07 pm April 5, 2017"
  },
  {
   "title": "non-functional requirements",
   "msg": "05:04 pm September 1, 2016\nWhat should we do with non-functional requirements to make them visible ?\nI think,It will be wise to add them to the definition of done so the work is taken care of every Sprint.\nSecond possibility is to put them on a separate list on the Scrum board, available for all to see.\nAm I correct ?\nWhat you think about adding non-functional requirements to the Product Backlog and keep the Product owner posted on the expected effort. It is good idea ?\nThanks in advance!",
   "url": "https://www.scrum.org/forum/scrum-forum/7314/non-functional-requirements",
   "last_post_date": "Last post 05:07 pm April 5, 2017"
  },
  {
   "title": "non-functional requirements",
   "msg": "07:47 am September 2, 2016\nDear Piotr,\nYou're right!\nIt's wise that teams try to include as many of the nonfunctional requirements in their definitions of done (DoD) as they possibly can. As regards adding nonfunctional requirements to the Product Backlog (PB), it depends.\nIf you have a requirement such as \"System must support Firefox, Chrome .. browsers\", put it in the DoD. If you have a story that delivers no perceived end-user value but does deliver important architecture or infrastructure needed to deliver future user value, put in in the PB as a technical story and involve the product owner in deciding how that new story should be positioned in the PB.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/7314/non-functional-requirements",
   "last_post_date": "Last post 05:07 pm April 5, 2017"
  },
  {
   "title": "non-functional requirements",
   "msg": "04:47 pm September 3, 2016\nPiotr,\nas Oleksii says, you are right. And as you said if the non-functional requirement affects all or almost all the PBIs, it should be added as a constrain to accomplish in your DoD. In the best case, the DT could write some tests that assure that the NFR is met. And of course the NFR can be in the PB, even you can express it as a User Story (Mike Cohn has written about it in his blog), anyway I think the most important thing is that the PO and the DT know that NFRs impact the code and have a cost that has to be taken into account.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/7314/non-functional-requirements",
   "last_post_date": "Last post 05:07 pm April 5, 2017"
  },
  {
   "title": "non-functional requirements",
   "msg": "12:11 am September 5, 2016\nAgree with adding them to the DoD; not so sure about adding them to the product backlog. NFR by itself cannot be delivered as an increment or prioritized properly. Unless you have special NFRs that depends only on a few user stories\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/7314/non-functional-requirements",
   "last_post_date": "Last post 05:07 pm April 5, 2017"
  },
  {
   "title": "non-functional requirements",
   "msg": "07:47 am September 7, 2016\nI'm not agree @Sujith...\nImagine you have a system which generates anything... Some NFR can be that the system works on some specific platform or OS. Another NFR ca be that the system can generate X transaction per hour or the system can accept N request per hour. Those are NFRs that the PO can prioritize, she can think if it's more important for the product to have a new feature or to be full operative on... let's say GNU/Linux or she prefers a new feature or to refactor as needed to adapt the system to accept N request per unit time. These NFRs are constraints that the system have to accomplish and they can be matched to system quality tests. These new capabilities are part or an Increment in itself and can be checked in the future as a part of it.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/7314/non-functional-requirements",
   "last_post_date": "Last post 05:07 pm April 5, 2017"
  },
  {
   "title": "non-functional requirements",
   "msg": "07:03 pm September 8, 2016\nWhen possible and logical, expanding the Definition of Done is great. Limiting the Product Backlog to proper user stories and functional requirements only certainly creates challenges. I disagree that non-functional requirements cannot be prioritized or delivered in an Increment; they probably shouldn't be the only value in an Increment.\nWith the browser support example, it sounds great to require it for a Done increment. However, if doing so requires a significant amount of effort (research, testing, development, infrastructure, addressing technical debt, etc.), then it probably makes sense to represent it in the Product Backlog . . .perhaps it is an \"epic\" or \"theme\" size initially and later refined into multiple, focused items. New work can be accomplished with the future Definition of Done in mind while the rest of the product is addressed.\nSimilarly with the other non-functional requirements noted above. Perhaps a software framework or component upgrade wold be beneficial to the users. While sometimes difficult to phrase as customer value, they can be important to delivering working and valuable software.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/7314/non-functional-requirements",
   "last_post_date": "Last post 05:07 pm April 5, 2017"
  },
  {
   "title": "non-functional requirements",
   "msg": "06:17 pm September 11, 2016\nThere's no need to express NFR as US indeed. As I pointed out before Mike Cohn wrote about creating US for NFRs, as I said there's no need to do it but if you do it you can get the benefit to understand who, what and the intention behind a NFR.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/7314/non-functional-requirements",
   "last_post_date": "Last post 05:07 pm April 5, 2017"
  },
  {
   "title": "non-functional requirements",
   "msg": "12:43 am September 17, 2016\nAn NFR can be an attribute of either product quality or product scope.\nIf the NFR must apply to each and every product increment, then it expresses a quality concern which may reasonably be observed via the Definition of Done. Otherwise it may reasonably be held to constitute product scope, and ordered on the Product Backlog accordingly.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/7314/non-functional-requirements",
   "last_post_date": "Last post 05:07 pm April 5, 2017"
  },
  {
   "title": "non-functional requirements",
   "msg": "03:26 pm April 5, 2017\n@Ian Mitchell,\n\"An NFR can be an attribute of either product quality or product scope.\nIf the NFR must apply to each and every product increment, then it expresses a quality concern which may reasonably be observed via the Definition of Done. Otherwise it may reasonably be held to constitute product scope, and ordered on the Product Backlog accordingly\"\nBased on the above, is it then safe to conclude that NFR's need NOT be captured in the DoD but it should be captured in the DoD only IF it affects the quality of product increment?\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/7314/non-functional-requirements",
   "last_post_date": "Last post 05:07 pm April 5, 2017"
  },
  {
   "title": "non-functional requirements",
   "msg": "05:07 pm April 5, 2017\nI was oversimplifying a bit, because an NFR may need rewriting or refactoring into parts that apply to both. In other words there may be elements of a single NFR which apply to every increment (and are thus assertions which must hold for Done), and other elements of the same NFR which constitute scope.\nFor example, a life-critical system may require a certain level of resilience. No increment may be considered Done unless it demonstrates that resilience. However, building that resilience in the first place may require the implementation of fail-over components which would be a matter of scope. A DoD asserting such resilience could only be applied once a Sprint Increment (e.g. the first one) is available which implements that scope.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/7314/non-functional-requirements",
   "last_post_date": "Last post 05:07 pm April 5, 2017"
  },
  {
   "title": "Virtual Teams in Scrum Model",
   "msg": "Messages",
   "url": "https://www.scrum.org/forum/scrum-forum/8163/virtual-teams-scrum-model",
   "last_post_date": "Last post 04:14 pm April 5, 2017"
  },
  {
   "title": "Virtual Teams in Scrum Model",
   "msg": "03:46 pm April 4, 2017\nIs Scrum model is applicable for virtual Team? if so how daily scrum,sprint review and sprint retrospective happen? by using conferences?\nPlease comment on this.",
   "url": "https://www.scrum.org/forum/scrum-forum/8163/virtual-teams-scrum-model",
   "last_post_date": "Last post 04:14 pm April 5, 2017"
  },
  {
   "title": "Virtual Teams in Scrum Model",
   "msg": "06:31 pm April 4, 2017\nWhatever a \"virtual team\" means in your situation, you can expect that it will demonstrate virtual teamwork. By definition it won't be real teamwork, otherwise it would be a real team.\nWhat do you think the consequences of that might be? Is the team still expected to produce real increments of real value?\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8163/virtual-teams-scrum-model",
   "last_post_date": "Last post 04:14 pm April 5, 2017"
  },
  {
   "title": "Virtual Teams in Scrum Model",
   "msg": "05:08 am April 5, 2017\nThanks for the reply...By using virtual teams in Scrum(not co-located) may reduce product increment delivery significantly.\ndue to communication with long distance and due to communication blockers etc.\nSince Scrum team is Self-Organised and Cross-Functional , it should support i guess...\nas i have not seen working as virtual teams in scrum.\nSo the question is does SCRUM supports virtual teams working style?\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8163/virtual-teams-scrum-model",
   "last_post_date": "Last post 04:14 pm April 5, 2017"
  },
  {
   "title": "Virtual Teams in Scrum Model",
   "msg": "04:14 pm April 5, 2017\nScrum is a framework. It can be implemented poorly or well. By correctly pointing out that non co-location \"may reduce product increment delivery significantly\", I think you've answered your own question about the degree to which it is supported.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8163/virtual-teams-scrum-model",
   "last_post_date": "Last post 04:14 pm April 5, 2017"
  },
  {
   "title": "How to improve communication within a team",
   "msg": "Messages",
   "url": "https://www.scrum.org/forum/scrum-forum/8088/how-improve-communication-within-team",
   "last_post_date": "Last post 12:24 pm April 5, 2017"
  },
  {
   "title": "How to improve communication within a team",
   "msg": "11:34 am March 30, 2017\nHi,\nI'm scrummaster. In my team, members have difficulty to communicate with each other.\nHow to improve this situation ? We have daily stand-up meeting.",
   "url": "https://www.scrum.org/forum/scrum-forum/8088/how-improve-communication-within-team",
   "last_post_date": "Last post 12:24 pm April 5, 2017"
  },
  {
   "title": "How to improve communication within a team",
   "msg": "07:22 am April 1, 2017\nWhat's the real reason of the communication gap within team?\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8088/how-improve-communication-within-team",
   "last_post_date": "Last post 12:24 pm April 5, 2017"
  },
  {
   "title": "How to improve communication within a team",
   "msg": "02:25 pm April 2, 2017\nHello Bakoa,\nI have experienced similar situations over the last 11 years that I have been working. I have used below methods in various teams and they worked pretty well:\n1. Avoid going toward all hierarchical structure (e.g. involving management).\n2. Talk to each individual and try to give them enough motivation by explaining how important is everyone's job in the success of product.\n3. Invite the team once per two weeks for dinner or a kind of social activity.\n4. If someone is late in a meeting, define a rule (however we are not really allowed to define our own rules according to SCRUM), that the late member should bring chocolate next time.\n5. If people are giving too many pauses to themselves at coffee machines or etc. just explain to them how important they are and pausing their job is actually lowering the overall performance.\nAs an overall advise, I would tell you be really careful of 'Toxic Employees'... don't let the situation get out of control where toxic employees take control. If you have this situation, it would be another subject.\nGood luck and let me know if you have any questions.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8088/how-improve-communication-within-team",
   "last_post_date": "Last post 12:24 pm April 5, 2017"
  },
  {
   "title": "How to improve communication within a team",
   "msg": "09:21 pm April 2, 2017\nHi,\nThe gap comes from the fear of disturbing his colleague by asking him questions.\nIs it necessary to have a guideline for this issue ?\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8088/how-improve-communication-within-team",
   "last_post_date": "Last post 12:24 pm April 5, 2017"
  },
  {
   "title": "How to improve communication within a team",
   "msg": "10:28 am April 3, 2017\nIf you think you need to leverage this, this is certainly because a sprint review raised this issue. If you raised an action plan for this dev to work on this aspect and had no result, I see several possibilities\n- Emphasis the Inception phase during the sprint planning, make them talk more on the very details of the solution to be developed ( if it appears the conclusion during sprint planning is to be reviewed during sprint, then, they will be more likely to work together )\n- if Daily meeting is mute, no difficulties etc --> note it on board, at the end of the sprint, when late or issues appears that could have been avoided by sharing, board will make it clear they must do something.\n- In last option, it is a fact that some developers are lonely cowboys, often impressive but enable to work in team. In this situation it is your responsibility to take the decision of requesting the replacement of the resource.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8088/how-improve-communication-within-team",
   "last_post_date": "Last post 12:24 pm April 5, 2017"
  },
  {
   "title": "How to improve communication within a team",
   "msg": "12:24 pm April 5, 2017\nHi Arash, Steve,\nThank you very much for your advices, they will be useful to me.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8088/how-improve-communication-within-team",
   "last_post_date": "Last post 12:24 pm April 5, 2017"
  },
  {
   "title": "Passed with 90%",
   "msg": "Messages",
   "url": "https://www.scrum.org/forum/scrum-forum/8123/passed-90",
   "last_post_date": "Last post 02:16 pm April 5, 2017"
  },
  {
   "title": "Passed with 90%",
   "msg": "05:47 pm April 2, 2017\nHi All,\nI just passed the PSM exam today, and I thought Id share how I passed it.\nI currently work as a Technical BA, but in my current and previous roles, I sometimes find myself acting as the SM, so I thought Id get the certification.\nI made a decision last week (29th Match) to sit the exam, and I read the scrum guide on the same day. It took about two hours to complete.\nI booked the exam and bought the PSM 1 Preparation Exam Practice the next day.\nBetween the 30th and 31st, I took the practice test (three of them), and I got 67%, 59% and 70%. I focused on the answers to the questions I failed, and the explanations were helpful. Next, I took the open assessment multiple times until I scored 100%, I think I tried it four times.\nYesterday, I took all the test again and got 87%, 87% and 90%.\nToday, I went through the scrum guide again, and I would recommend this  it was helpful.\nImmediately after going through the guide, I took one of the practice tests, and I got 92%.\nAlthough my plan was to sit the PSM exam tomorrow, I felt confident and took it after the test and I got 90%.\nP.S  I wasnt sure of buying the PSM 1 Preparation Exam Practice and I thought I could pass the exam without it, but I was wrong. I wouldnt have passed the exam on my first try without it.\nHope this was helpful and good luck to those sitting their PSM 1 exam soon.\nThanks,\nT.O",
   "url": "https://www.scrum.org/forum/scrum-forum/8123/passed-90",
   "last_post_date": "Last post 02:16 pm April 5, 2017"
  },
  {
   "title": "Passed with 90%",
   "msg": "11:26 am April 5, 2017\nThought I'd also sit the PSPO I exam.\nI prepared for two days with the PSPO I exam practice and Scrum Open assessment, and I got 88% - Not the best score, but I'm glad I passed.\nI didn't sit the exam until I was comfortably getting above 95% in each of the simulated exam and 100% in the open assessment.\nReading the scrum guide again would probably have got me better results, so I would advise anyone taking this exam to go through the scrum guide again before sitting the PSPO I.\nAgain, good luck to those taking their exams soon!\nThanks,\nT.O\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8123/passed-90",
   "last_post_date": "Last post 02:16 pm April 5, 2017"
  },
  {
   "title": "Scrum practioner questions",
   "msg": "Messages",
   "url": "https://www.scrum.org/forum/scrum-forum/8181/scrum-practioner-questions",
   "last_post_date": "Last post 10:20 am April 5, 2017"
  },
  {
   "title": "Scrum practioner questions",
   "msg": "10:20 am April 5, 2017\nI got only 9 out of 15 for the follwoing practionaer exam.. Not sure wher i am wrong:( Can someone please help me with the correct answers\n1) A multi-national company, which has five major products, is using Scrum for product development. Which statements are the two best alternatives for how many Product Owners exist? (Choose 2.)\nA)As many as are needed to communicate expectations and requirements with Development Teams.\nB)One specific Product Owner is responsible for all five products. This Product Owner may delegate to others for specific value, capabilities, and functionality within each product.\nC)One and only one. The Product Owner may not delegate to others for specific value, capabilities, and functionality.\nD)One specific Product Owner is responsible for each product. This Product Owner may delegate to others for specific value, capabilities, and functionality within the product.\n2)What is the purpose of a Scrum of Scrums?\na)Align plans for different Scrum Teams by bringing the Scrum Masters together every day.\nb)Meet to report to stakeholders.\nc)Align Product Backlogs of related products by bringing their Product Owners together.\nd)Share cross-team experiences of different Scrum Masters.\ne)Align plans of different Development Teams working on the same product\nMy answer : d\n3) What are two good ways for a Scrum Team to ensure that security concerns are satisfied?\nAdd a Sprint to specifically resolve all security concerns.\na)Postpone the work until a specialist can perform a security audit and create a list of security-related Product Backlog items.\nb)Delegate the work to the concerned department.\nc)Add security concerns to the definition of \"Done\".\nd)Have the Scrum Team create Product Backlog items for each concern.\n-> Answer c) and d)\n4)One of the Scrum events is the Daily Scrum. What are two outcomes of the Daily Scrum?\na)A shared understanding of the most important work to be undertaken next to achieve the best possible progress toward the Sprint goal\nb)A status report indicating what each individual has done, will be doing, and what is impeding him/her\nc)A checklist of completed tasks and an update of the estimates for the remaining tasks that the Scrum Master can use to administer the development work\nd)An updated Scrum board to give visibility over the Sprint's progress for when the stakeholders come visit the development room\ne)An update of impediments for the Scrum Master to take care of\nMy answers : a,e\n5) Self-organization works best when there are goals and boundaries. Select two requirements from the Scrum framework that are key for a Scrum master to teach teams to help them self-organize:\na. Time-boxing events to manage risks\nb. Forming teams happens by the Product Ownder selecting each member\nc. Having an even number of team memebers to be able to do pair programming\nd. Creating a releasable Increment by the end of each Sprint\ne. Maintaining and preferably increasing velocity.\nAnswer: a and d\n6) A Development Team selects a set of Product Backlog items for a Sprint Backlog with the intent to get the selected items \"Done\" by the end of the Sprint. Select two items that explains what done means\na) no work left from the definition of Done.\nb)All work performed given the skills that are actually present in Devlopment team\nc)Ready for functional testing by PO\nd)Whatever the product owner defines as quality\ne)Ready for integration\nf) All work to create software usable by end users\n->d and f\n7. You are part of a group of 500 developers that is responsible for building a large enterprise product. How should the architecture for the product be defined in order to effectively support this many developers working on the same product at the same time?\na) A team should design and build architectural and platform structures that define how the functionality from each set of Scrum Teams must deliver and work with each other.\nb) Perform Subsystem Design. Teams should volunteer to develop specific areas of sub-system responsibility.\nc) The architecture will emerge during development through early Product Backlog items\nd) An architectural backlog should be created to ensure that architectural concerns are addressed in the product development process.\nMy answer : A)\n8)Many Development Teams working in the same code creates\ncoordination problems which can be sufficiently addressed\nwith a comprehensive branching and merging model in\nshared version control.\n> True\n> False\nAnswer:True\nQuestion 9: How should multiple Scrum Teams deliver a done, potentially shippable Increment in a Sprint for a project?\na)Each Scrum Team provides a unique done Increment that includes the team's added functionality.\nb)Each Scrum Team delivers done Increments of its own area of responsibility. These Increments are integrated into a whole product during stabilization prior to release.\nc)Functionality not integrated with the work of other Scrum Teams may be delivered as unintegrated Increments. This demonstrates the value created by the Scrum Teams unable to completely integrate their Increments.\nd)Each Sprint, all Scrum Teams have a done Increment that integrates with all of the other done Increments from all other Scrum teams on the initiative. The sum of all of Increments is the Increment for that initiative or project.\nAnswer:b\n10) Which two ways of creating Development Teams are consistent with Scrum's values?\na) The Chief Product Owner determines the new team structures and assignments.\nb) Bring all the developers together and let them self-organize into Development Teams.\nc) Managers personally re-assign current subordinates to new teams.\nd) Existing teams propose how they would like to go about organizing into the new structure.\ne) Managers collaborate to assign individuals to specific teams.\n-> b) and d)\n11) Currently, your Development Teams are organized to address a single layer only (for example, front end, middle tier, back end, and interfaces). What are three things to consider when deciding to move away from such component teams toward feature teams?\na) Productivity may suffer when making this kind of move.\nb) You cannot do Scrum without feature teams.\nc) With feature teams, it is easier to calculate the productivity per team.\nd) Feature teams have less communication overhead.\ne) Getting support from the business side first helps.\n->Answers: b d and e\n12)What three techniques should the Scrum Master use when the Scrum Team gets caught in an internal disagreement about which development techniques to apply?\na)Involve the complete team.\nb)Ask an external technical specialist to make the decision.\nc)Send every team member to the company's HR department to express their concerns.\nd)Use coaching techniques like open questions and active listening.\ne)Consult with team members individually, carefully listening.\nANSWERS: a, d and e\n13 - To improve average velocity across multiple Scrum Teams, analysts are encouraged to employ a \"Definition of Ready\" to ensure all items selected during Sprint Planning meetings are actionable.?\na) True\nb) False\nAnswer False\n14) Select two ways in which technical debt impacts transparency.\na) It enhances transparency for the Product Owner as a Development Team is not allowed to do additional feature development in a Sprint as long as there is technical debt.\nb) As development progresses and code is added, the system becomes more difficult to stabilize, which results in future work being slowed down in unpredictable ways.\nc) It leads to false assumptions about the current state of the system, specifically of an Increment being releasable at the end of a Sprint.\nd) When calculated and estimated, the total amount of technical debt shows exactly how long until the Product Owner can release the Increment.\n-> a and c\n15) What are two ways that architecture and infrastructure are handled in Scrum?\na)They are discussed during Product Backlog refinement and are developed only along with selected functionality.\nb)They are added to the Product Backlog and addressed in early Sprints, while always requiring at least some business functionality, no matter how small.\nc)They are built by a separate team through the creation of an architectural runway.\nd) They are discussed, determined, and documented before the actual feature development Sprints.\n--> a and b",
   "url": "https://www.scrum.org/forum/scrum-forum/8181/scrum-practioner-questions",
   "last_post_date": "Last post 10:20 am April 5, 2017"
  },
  {
   "title": "Scrum Master Role In Building A Self Organized Team",
   "msg": "Messages",
   "url": "https://www.scrum.org/forum/scrum-forum/8169/scrum-master-role-building-self-organized-team",
   "last_post_date": "Last post 03:50 am April 5, 2017"
  },
  {
   "title": "Scrum Master Role In Building A Self Organized Team",
   "msg": "03:50 am April 5, 2017\nScrum Master Role In Building A Self Organized Team\nApart from a cross functional team, having a self organized team is one of the key-strength in Scrum.\nTheir must have a single purpose: Achieving the Sprint Goal\nI will share some of my experiences with my Scrum Teams in this article.\nRead more at:\nhttps://annalogy.info/2017/04/03/scrum-master-role-in-building-a-self-organized-team/\n#scrum #scrummaster #annalogy #it #informationtechnology #article #agile",
   "url": "https://www.scrum.org/forum/scrum-forum/8169/scrum-master-role-building-self-organized-team",
   "last_post_date": "Last post 03:50 am April 5, 2017"
  },
  {
   "title": "Thoughts about *How Scrum works in a fixed Price Projects\"",
   "msg": "Messages",
   "url": "https://www.scrum.org/forum/scrum-forum/5332/thoughts-about-how-scrum-works-fixed-price-projects",
   "last_post_date": "Last post 02:09 pm April 5, 2017"
  },
  {
   "title": "Thoughts about *How Scrum works in a fixed Price Projects\"",
   "msg": "03:28 am September 27, 2012\nHi,\nThe other day, I have been asked a question about how to bring scrum into fixed price projects... Interesting though.\nI would like you expert guys to give some thoughts about this.\nAny experiences would be highly appropriated.\n/Usman",
   "url": "https://www.scrum.org/forum/scrum-forum/5332/thoughts-about-how-scrum-works-fixed-price-projects",
   "last_post_date": "Last post 02:09 pm April 5, 2017"
  },
  {
   "title": "Thoughts about *How Scrum works in a fixed Price Projects\"",
   "msg": "02:33 pm September 27, 2012\nThe question can be answered this way:\n\"You will get what will be done up to the budget limit!\" In scrum, each sprint will deliver potentially shippable increment to the product. This means that if the product backlog is well prioritized, high-value features will be done soon during the project, resulting in a product that quickly has value. Each sprint will add value to the product. When the budget is reached, normally you should have something to deliver. Maybe it will not offer all the inital features you were expecting, but maybe you could be surprised to finally deliver more, or even better, deliver something that fits the customer needs better!\nNow... This question is often biased by a subsequent or underlying question: what happens if the budget is fixed, the timebox is freezed and we promissed to deliver all the functionalilities? This is what I call the \"iron triangle\", no variables, only solid-framed limitations... Get prepared to negociate! This is what agile tries to change!\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5332/thoughts-about-how-scrum-works-fixed-price-projects",
   "last_post_date": "Last post 02:09 pm April 5, 2017"
  },
  {
   "title": "Thoughts about *How Scrum works in a fixed Price Projects\"",
   "msg": "09:38 am October 9, 2012\nGood morning, Leo.\n(I really hate the expression \"In a perfect world\", but...) In a perfect world, \"You will get what will be done up to the budget limit\" is fine. In the real world... I have been consulting in software development for 34 years and I have never met a manager who would stand still for that.\nThis is a question to which I have yet to find a satisfactory, or even marginally satisfying answer.\nMost engineering and manufacturing companies, that aren't pure \"think tanks\", when they envision a new project to develop a new product, have a time and cost budget in mind beyond which it is no longer time-effective or cost-effective to develop the product. Maybe they have to get it out into the marketplace by a certain time or they lose their window of opportunity. Maybe the product has to sell at or below a certain price point or no one will buy it.\nMost Agile (upper-case \"A\") processes emphasize the time to complete the next increment (the next \"sprint\" or whatever one wants to call it) and don't pay much attention to how long it is projected to take to complete the whole project. Ditto costs... most Agile processes don't seem to pay significant attention to development cost targets.\nSo, precisely HOW is it that one convinces senior management of the benefits of Agile processes when the managers' major focus (it's in their job descriptions) is on time-to-market and total cost figures?\nNote the difference between \"Agile\" (upper-case \"A\") and \"agile\" (lower case)... I consider the former to mean a defined process that conforms to the Agile Manifesto. The latter is what most people, particularly software managers, mean when they use the term... at best, they take it to mean \"anything that is faster than how we have done it before\" including any of the iterative processes that have been in use for decades.\nEric Poole\nwww.rkt-tech.com\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5332/thoughts-about-how-scrum-works-fixed-price-projects",
   "last_post_date": "Last post 02:09 pm April 5, 2017"
  },
  {
   "title": "Thoughts about *How Scrum works in a fixed Price Projects\"",
   "msg": "08:32 am October 14, 2012\nHi Eric and Usman,\nHave you guys taken Professional Scrum Master Course already? The trainer will teach you about fixed price contracts in Agile.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5332/thoughts-about-how-scrum-works-fixed-price-projects",
   "last_post_date": "Last post 02:09 pm April 5, 2017"
  },
  {
   "title": "Thoughts about *How Scrum works in a fixed Price Projects\"",
   "msg": "08:47 am October 14, 2012\nThanks, Joshua, but that's a little bit like saying \"Buy this book and it will tell you\". Forums (fora? fori?) like this one are for getting answers to specific questions, helping one another, and holding discussions, without having to go to the expense of traveling to some course or buying some book.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5332/thoughts-about-how-scrum-works-fixed-price-projects",
   "last_post_date": "Last post 02:09 pm April 5, 2017"
  },
  {
   "title": "Thoughts about *How Scrum works in a fixed Price Projects\"",
   "msg": "09:51 am October 18, 2012\nHello.\nI'm quite new to scrum, but I'm really trying to learn by reading and reading and participating in trainings, so my thoughts are:\nScrum does not mean \"no plan/no estimation\" In the beginning of a product development you have to figure out what the needs of a customer are, and of course, they are estimated.\nNevertheless it is clearly stated, that those estimates are only rough estimates to get a plan how many sprints you need to deliver if you know the velocity of your team.\nI know, this does not sound like scrum estimates are really exact, but in my experience with waterfall projects I found the same but with more investment in the planning, because the best IEEE-requirement-sheet always only says \"it is as described if nothing changes!\"\nSo my project planes in waterfall most of the time show something like \"exact dates\" but this is an illusion MS project gives me ;-)\nI heard about an interesting presentation about selling this agility to the customer: Jeff Sutherland talking about \"Money for nothing, Changes are free\" google it, I think it's quite interesting.\nSo estimating (and fixed price projects are much about estimating) is always hard and the bigger the project and the more unknown a domain is, the harder it gets. But scrum does not make it harder, it makes it faster and more flexible.\nmay I was able to bring a few things/thoughts in this discussion.\nBr,\nPhilipp\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5332/thoughts-about-how-scrum-works-fixed-price-projects",
   "last_post_date": "Last post 02:09 pm April 5, 2017"
  },
  {
   "title": "Thoughts about *How Scrum works in a fixed Price Projects\"",
   "msg": "01:14 pm November 11, 2012\nEric, one could have a good enough Product Backlog holding requirements and other ideas to build into the product, consider expected team size, look at past velocity or comparable figures to figure out the estimated #Sprints and have an indication of timing and cost. Actual implementation is still required to validate all these assumptions. If time and budget have been fixed, scope will become negotiable. Product Backlog and progress on it (e.g. burn-down) will keep all involved informed about the feasibility of the initial plan.\nThe amount of detail that's put in the initial Product Backlog depends on the level of trust in general. Creating an exhaustive, fully detailed Product Backlog is not helping much but may be required. Do note that this is not an obligation posed by Scrum, but a decision taken outside of Scrum.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5332/thoughts-about-how-scrum-works-fixed-price-projects",
   "last_post_date": "Last post 02:09 pm April 5, 2017"
  },
  {
   "title": "Thoughts about *How Scrum works in a fixed Price Projects\"",
   "msg": "01:17 pm November 11, 2012\nThere is always something like (\"Yes, but reality\"). As in my answer to Eric, always look for highest achievable. Nevertheless, if I give my honest opinion to people on the topic of fixed prices, in general everyone agrees with my statement: \"Fixed Price bids. An open invitation to bribe, cajole, lie and cheat.\". All my thoughts at http://ullizee.wordpress.com/2012/10/07/fixed-price-bids-an-open-invita\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5332/thoughts-about-how-scrum-works-fixed-price-projects",
   "last_post_date": "Last post 02:09 pm April 5, 2017"
  },
  {
   "title": "Thoughts about *How Scrum works in a fixed Price Projects\"",
   "msg": "09:54 am November 13, 2012\nMy 2cents worth: The problem with Fixed Priced Bids is that it is based on a contract...and therefore the contract takes precedence over everything else. This would go against the AGILE Values of valuing customer collaboration over contract negotiation. In my experience (at various clients), once the AGILE mindset and the thinking behind scrum is explained to the client, the need or demand for a fixed bid price is dropped in favor of the client being able to continuously 'direct' the product. This is the value of SCRUM and AGILE in my world. Alas, Fixed price contracts are going to be around for a while though...\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5332/thoughts-about-how-scrum-works-fixed-price-projects",
   "last_post_date": "Last post 02:09 pm April 5, 2017"
  },
  {
   "title": "Thoughts about *How Scrum works in a fixed Price Projects\"",
   "msg": "03:57 pm November 28, 2012\nI recently applied Scrum within the DSDM framework to support public sector fixed price contracts. Essentially, this was done by treating a Sprint as a DSDM delivery timebox, and therefore as a trading space for negotiating requirements in or out of scope. Cost and time were fixed, but scope became variable. The tradeable scope consisted of the Should and Could requirements of a MoSCoWed sprint backlog.\nAdmittedly this was done before the Scrum Guide changed from sprint commitments to forecasts, but I suppose it might be possible to do something similar by placing the contractual emphasis upon sprint goals rather than upon a sprint backlog.\nFixed price work certainly presents challenges for agile practice, but I agree that it is going to be with us for a while yet.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5332/thoughts-about-how-scrum-works-fixed-price-projects",
   "last_post_date": "Last post 02:09 pm April 5, 2017"
  },
  {
   "title": "Thoughts about *How Scrum works in a fixed Price Projects\"",
   "msg": "06:06 pm October 20, 2016\nTypically here is what we have seen:\nIf you fix cost/price and time (time is cost really assuming fixed team) and deliverables, then you can only affect quality (assuming fixed team or team changes wouldn't have significant impact). That is bad. So optimally you develop trust with your customer and fix budget and time and incrementally deliver. Because estimation for work further away is not optimal this is the best case.\nHowever if your customer doesn't trust you yet to honor your commitments then you need a really experienced and stable scrum team with extremely consistent pointing skills. Then it is possible to take epics, break into stories and fix price many types of projects assuming the amount of research is minimal.\nSo if you are doing your fifth inventory system as a stable team it's doable using velocity based planning. Otherwise, you end up just lying to yourself and your customer and continuing the vicious cycle of them not trusting you or constantly compromising and trading off.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5332/thoughts-about-how-scrum-works-fixed-price-projects",
   "last_post_date": "Last post 02:09 pm April 5, 2017"
  },
  {
   "title": "Thoughts about *How Scrum works in a fixed Price Projects\"",
   "msg": "11:25 pm October 20, 2016\nFirst question is what and who was used to Estimate the project to come up with the Price? Is it based on what a project of this size would cost when your usual project methodology was used?\nIf it's a project that only has the budget of what's left in the kitty, then it becomes a bit tricky.\nThe emphasis in my opinion should not be so much on the SCRUM Master, but on the Product Owner. He or she should be very mindful of the scope and therefor what can be done with the limited budget. If the business only has money for the basic version of the Toyota Camry, then the expectation should not be that the Deluxe version can be delivered, just because SCRUM is flexible in the requirements.\nOne of the main objections of using SCRUM is that the more experienced developers don't like it and many say that it 'dumbs down' their work... they may be right. For a fixed price SCRUM project that might be an advantage as you could get away with hiring less experienced and therefor less expensive developers... just a thought.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5332/thoughts-about-how-scrum-works-fixed-price-projects",
   "last_post_date": "Last post 02:09 pm April 5, 2017"
  },
  {
   "title": "Thoughts about *How Scrum works in a fixed Price Projects\"",
   "msg": "01:22 am October 21, 2016\nNicko, never heard of experienced developers not liking scrum. I have heard of less informed experienced people not liking scrum because they don't really understand it as well as they think. They put the emphasis on the ceremonies instead of the planning and measuring and communication aspects. However it has been shown that a team that has a strong set of values and purpose are for more predictable in terms of productivity than experience alone. So I would rather have a focused set of less experienced developers that are motivated and focused and clear on our objectives and how we are going to execute our work than a bunch of experienced developers that want to act as independent silos and just code.\nOf course experienced developers who are focused, clear on the objectives and truly understand the Agile mindset and have a long track record working together as a cohesive team would be best...\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5332/thoughts-about-how-scrum-works-fixed-price-projects",
   "last_post_date": "Last post 02:09 pm April 5, 2017"
  },
  {
   "title": "Thoughts about *How Scrum works in a fixed Price Projects\"",
   "msg": "02:21 am November 2, 2016\nSometimes FP is associated with waterfall. And it's partly true, 'cause you cannot make an FP bid if you don't know the requirements. But the question is about running a FP project, not initiating it.\nI like the comparison heard somewhere: it is like a vacation. You have a budget and a time -- and it's up to you what you do tomorrow: relaxing, driving,hiking, or something else. It'll be over when you achieve the goal, or spent your budget.\nI'm applying Scrum on a FP project. Have contract, have timeline, have predefined set of modules to deliver, and have estimates for each of them. When we have stories/requirements ready - we review them with the dev team against the original estimates on the BL refinement meetings. It's a good point to review the complexity and make a decision to lower/higher the grain. The result can be compared with the original plan, so I can even do EVM.\nFrom other perspective - it's a little bit more challenging when the scope is changing (creeping). If it cannot be aligned with the original limitations - then the only right thing for me is to review the contract with the counter-parts and to execute an amendment if possible.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5332/thoughts-about-how-scrum-works-fixed-price-projects",
   "last_post_date": "Last post 02:09 pm April 5, 2017"
  },
  {
   "title": "Thoughts about *How Scrum works in a fixed Price Projects\"",
   "msg": "08:06 am April 4, 2017\nYou should know, that fixed price projects have got not only advantages but disadvantages. Look at this picture published by Cleveroad - https://www.cleveroad.com/blog/time-and-material-vs-fixed-price--hot-discussion-of-the-best-pricing-model\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5332/thoughts-about-how-scrum-works-fixed-price-projects",
   "last_post_date": "Last post 02:09 pm April 5, 2017"
  },
  {
   "title": "Thoughts about *How Scrum works in a fixed Price Projects\"",
   "msg": "12:46 am April 5, 2017\nScrum becomes probably irrelevant when one speaks about \"fixed price\". If the price and feature-set are fixed, then someone had already decided.\nI've another question, though. How do you deal with tenders? How do you attach a price to a tendered project knowing that you can't be too lax because you'll risk losing against a competitor or too strict because you'll lose money?\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/5332/thoughts-about-how-scrum-works-fixed-price-projects",
   "last_post_date": "Last post 02:09 pm April 5, 2017"
  },
  {
   "title": "Unable to Understand a statement in Scrum Guide",
   "msg": "Messages",
   "url": "https://www.scrum.org/forum/scrum-forum/8148/unable-understand-statement-scrum-guide",
   "last_post_date": "Last post 09:11 pm April 4, 2017"
  },
  {
   "title": "Unable to Understand a statement in Scrum Guide",
   "msg": "06:34 am April 4, 2017\nI was just going through the scrum guide and under the sub section Topic Two: How will the chosen work get done? i read the below statement\nWork planned for the first days of the Sprint by the Development Team is decomposed by the end of this meeting, often to units of one day or less.\nDoes it mean that work that will be done at the start of sprint will be discussed at the end of sprint planning? Or what exactly it refers to?",
   "url": "https://www.scrum.org/forum/scrum-forum/8148/unable-understand-statement-scrum-guide",
   "last_post_date": "Last post 09:11 pm April 4, 2017"
  },
  {
   "title": "Unable to Understand a statement in Scrum Guide",
   "msg": "09:04 pm April 4, 2017\nIt just means that before the sprint planning is finished the Development Team will have the work for the first days of sprints decomposed to smaller bits - usually one day or less.\nThey don't have to do this for all the elements taken to the sprint. Elements for later part of the sprint can be decomposed later. So at the end of the meeting team should have some strict vision, plan for the first days reflected by set of really small tasks and some rough vision how other elements will be delivered and how they will achieve the sprint goal.\nWhy? Because \"the Development Team should be able to explain to the Product Owner and Scrum Master how it intends to work as a self-organizing team to accomplish the Sprint Goal and create the anticipated Increment.\".\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8148/unable-understand-statement-scrum-guide",
   "last_post_date": "Last post 09:11 pm April 4, 2017"
  },
  {
   "title": "More than one product manager across a single platform?",
   "msg": "Messages",
   "url": "https://www.scrum.org/forum/scrum-forum/8149/more-one-product-manager-across-single-platform",
   "last_post_date": "Last post 06:22 pm April 4, 2017"
  },
  {
   "title": "More than one product manager across a single platform?",
   "msg": "06:43 am April 4, 2017\nGood morning!\nI'm looking for advice - has anyone seen or experienced examples of how to coordinate and prioritize multiple product backlogs across a single technology stack, e.g. a web site powered by a single CMS? We need to get to place where we can iteratively improve more than one product/customer journey simultaneously. I'm trying to vision the sorts of people, processes and tools needed for this to work. I'd really appreciate any experience others in the community have of seeing this sort of thing succeed (or fail!)\nMany thanks in advance,\nJon",
   "url": "https://www.scrum.org/forum/scrum-forum/8149/more-one-product-manager-across-single-platform",
   "last_post_date": "Last post 06:22 pm April 4, 2017"
  },
  {
   "title": "More than one product manager across a single platform?",
   "msg": "06:22 pm April 4, 2017\nIf these products share a technology stack, might they then have dependencies which must be resolved for integrated increments to be produced? If so, I'd suggest that's where your vision should be. In Scrum, teams ought to be encouraged to self-organize around such things, and their processes and tools ought to facilitate that very integration. Remember that the only real measure of progress is the incremental release of working product.\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8149/more-one-product-manager-across-single-platform",
   "last_post_date": "Last post 06:22 pm April 4, 2017"
  },
  {
   "title": "Completed PSM 1 with 96.3% first attempt",
   "msg": "Messages",
   "url": "https://www.scrum.org/forum/scrum-forum/8142/completed-psm-1-963-first-attempt",
   "last_post_date": "Last post 05:29 pm April 4, 2017"
  },
  {
   "title": "Completed PSM 1 with 96.3% first attempt",
   "msg": "06:16 pm April 3, 2017\nHi all, thanks to those who have answered questions here in these forums, because I was able to pull up so many questions and read clear explanations and get links to sections of the guide or other examples that helped me understand concepts during my studies.\nI took six days to prepare for the exam, I was familiar with Agile concepts and have used Agile Management on certain projects since 2013. I chose Scrum.org over Scrum Alliance because of the more serious assessment and my research indicated the materials here are an improvement and evolution of the CSM materials. I am pleased with my choice.\nThe materials I foccussed on to prepare were:\n1) Read the Scrum guide six times completely, and referenced it numerous times when going through study guides or practice exams. I made sure to read the scrum guide again one more time before sitting the exam because this is the bible in terms of the assessment.\n2) I bought the kindle book Called Scrum Narrative and PSM Exam Guide - by Mohammed Musthafa Soukath Ali and read parts 1 and 3 and did the 80 question exam at the end. I found this book to be confusing and some of the questions had the author's personal interpretation of the Scrum Guide in the content and answers. I couldn't verify all the answers in Scrum.org writings or in the Scrum Guide directly and didn't necessarily agree with his interpretations. Unless you're already feeling comfortable at a fairly deep level with other Scrum materials I wouldn't pick this book up.\n3) The online help attendant at Management Plaza was great in setting me up on their PSM Preparation Practice Exam bundle and I did each of their 80 question exams (3 different versions) at least three times until I was scoring between 92 and 97%. They also have a free Training Manual that was a very well written and laid out expansion on the Scrum Guide that I read twice and made notes from. Overall I found the content from Management Plaza to be very high and I recommend the two products I studied from, they both definitely helped me pass the assessment. They also have an online course that is more detailed but I didn't buy that.\n4) I took the Open Assessments for the three Scrum Team roles multiple times. The one for Developers gets into detailed technical tools and that won't appear on the PSM assessment but there were good questions in there about the Scrum Team roles and the events so it's worth doing this for practice anyway. The Product Owner open assessment is good to take multiple times too. Make sure you're consistently getting 100% on the Scrum Master and Product Owner open assessments before you take your exam. There were a good number of these that appeared on my actual exam so it's great practice.\n5) Mikhail Lapshin has a free 80 page practice exam that I recommend highly. It uses exact terms from the Scrum Guide and has very good explanations of the correct answer, again using terms from the Scrum Guide. There was almost no interpretation here, and I felt confident I wasn't getting confused or misled by practicing on this exam. Take it until you're getting over 95%. Make sure that if you want to review your answers that you do so BEFORE you hit finish. There is no option afterwards to read correct answer, you can't go back and see the questions either.\nSOME TIPS FOR WHEN YOU'RE TAKING THE EXAM\na) Don't think you can google for the right answer. You should be able to rely on your notes to confirm tricky questions, if you know the Scrum Guide very well you'll be able to get to the relevant section where a lot of the answers lie. But you need to get through the whole exam before you start trying to look things up. Save that time for tricky questions to the end.\nb) Read carefully about how many answers you should select. And select the BEST answers. Often there is an additional answer that might also be true, but is not the most critical answer out of your options. Make sure to read whether you're being asked to pick TRUE or UNTRUE statements out of the answers. You need to read the question twice before you start picking options.\nc) When it comes to questions involving the Development Team, lean towards them being in full control of the Sprint Log, HOW they will work, what work they add to the Sprint log, they don't update stakeholders outside of the Sprint Review... they have their heads down creating the product during the sprint. In your answers understand that their time is shielded by the Scrum Master who makes sure that the organization understands how to interact with the Development Team (let them do their thing) and the Product Owner who keeps the Stakeholders informed. The Development Team manage themselves.\nd) Print the Scrum Glossary and have it with you. Print the Values poster and have it with you. Print the Scrum Guide and have it with you. Take your own notes and organize them into \"Roles\", Artefacts, Events, Rules. Have them with you. Lay all your info out in a way that you know where to go to grab each resource when you need to.\nDON'T BOTHER WITH:\n1) You don't need to read the recommended books in the knowledge areas link, you'd take months to prepare for the assessment if you did. For your ongoing improvement in Scrum then certainly pick up whichever ones you find interesting\n2) Avoid the SBOK Scrum Body of Knowledge, it won't prepare you for PSM and mixes other Agile domains\n3) Don't pay a lot of money to take any online prep courses. If money is no object to you then go ahead with an in-person course in your area, and sit the exam shortly after and you should have a good shot at passing. But there's no reason to pay over $300 for a prep course to get ready for a $150 exam.\n4) Don't sit the actual exam until you're consistently getting 100% on the open assessments and mid 90s on the other practice exams I listed above.",
   "url": "https://www.scrum.org/forum/scrum-forum/8142/completed-psm-1-963-first-attempt",
   "last_post_date": "Last post 05:29 pm April 4, 2017"
  },
  {
   "title": "Completed PSM 1 with 96.3% first attempt",
   "msg": "04:53 pm April 4, 2017\nCongrats Mark!\nAnd thanks for the well organised tips for the exam!!\nLog in or register to post comments",
   "url": "https://www.scrum.org/forum/scrum-forum/8142/completed-psm-1-963-first-attempt",
   "last_post_date": "Last post 05:29 pm April 4, 2017"
  }
 ]
}